{
  "number": 23,
  "title": "Persons entitled to be registered as citizens",
  "chapterNumber": 3,
  "chapterTitle": "Citizenship",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Any person who, on the appointed day, is a citizen of the United Kingdom and Colonies, having become such a citizen by virtue of his having been naturalised or registered in the United Kingdom or in a former colony of the United Kingdom other than Malta, who was ordinarily resident in Malta during the two years immediately preceding the appointed day, shall be entitled, upon making application before the appointed day in such manner as may be prescribed, to be registered as a citizen of Malta."
    },
    {
      "paragraph": 2,
      "text": "(2) Any person who, on the appointed day, is a citizen of the United Kingdom and Colonies, having become such a citizen by virtue of his birth, naturalisation or registration in the United Kingdom or in a former colony of the United Kingdom other than Malta, shall, if his father becomes, or would but for his death have become, a citizen of Malta by virtue of his having been naturalised or registered in Malta as a citizen of the United Kingdom and Colonies, be entitled, upon making application before the appointed day or such later date as may be prescribed, to be registered as a citizen of Malta."
    },
    {
      "paragraph": 3,
      "text": "(3) Any woman who, on the appointed day, is or has been married to a person (a) who becomes a citizen of Malta by virtue of article 22 of this Constitution; or (b) who, having died before the appointed day, would, but for his death, have become a citizen of Malta by virtue of that article, shall be entitled, upon making application in such manner as may be prescribed and, if she is a British protected person or an alien, upon taking the oath of allegiance, to be registered as a citizen of Malta."
    },
    {
      "paragraph": 4,
      "text": "(4) Any woman who, on the appointed day is married to a person who becomes or would, but for his death, become entitled to be registered as a citizen of Malta under sub-article (1) or sub-article (2) of this article, but whose marriage has been terminated by death or divorce, shall be entitled, upon making application before such date and in such manner as may be prescribed and, if she is a British protected person or an alien, upon taking the oath of allegiance, to be registered as a citizen of Malta."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [
    {
      "articleNumber": 22,
      "chapterNumber": 3,
      "description": "Persons who become citizens on appointed day"
    }
  ],
  "notes": "This article establishes who was entitled to register as Maltese citizens following independence."
} 