{
  "number": 24,
  "title": "Acquisition of citizenship by birth or descent by persons born on or after appointed day",
  "chapterNumber": 3,
  "chapterTitle": "Citizenship",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Every person born in Malta on or after the appointed day shall become a citizen of Malta at the date of his birth:"
    },
    {
      "paragraph": 2,
      "text": "Provided that a person shall not become a citizen of Malta by virtue of this sub-article if at the time of his birth -"
    },
    {
      "paragraph": 3,
      "text": "(a) neither of his parents is a citizen of Malta and either of his parents possesses such immunity from suit and legal process as is accorded to an envoy of a foreign sovereign power accredited to Malta; or"
    },
    {
      "paragraph": 4,
      "text": "(b) either of his parents is an enemy alien and the birth occurs in a place then under occupation by the enemy."
    },
    {
      "paragraph": 5,
      "text": "(2) A person born outside Malta on or after the appointed day shall become a citizen of Malta at the date of his birth if at that date his father and mother are citizens of Malta otherwise than by virtue of this sub-article or sub-article (2) of article 22 of this Constitution."
    },
    {
      "paragraph": 6,
      "text": "(3) A person born outside Malta on or after the appointed day who is not a citizen of Malta by virtue of sub-article (2) of this article shall become a citizen of Malta at the date of his birth if at that date his father or his mother is a citizen of Malta otherwise than by virtue of this sub-article or sub-article (2) of article 22 of this Constitution."
    }
  ],
  "amendmentHistory": {
    "date": "1989-08-01",
    "description": "Amendment to include both parents in citizenship determination",
    "legalReference": "Act XXIII of 1989"
  },
  "crossReferences": [
    {
      "articleNumber": 22,
      "chapterNumber": 3,
      "description": "Persons who become citizens on appointed day"
    }
  ],
  "notes": "This article establishes how citizenship is acquired by birth or descent for persons born on or after Malta's independence."
} 