{
  "number": 81,
  "title": "Tenure of office of Ministers",
  "chapterNumber": 7,
  "chapterTitle": "The Executive",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) If the House of Representatives passes a resolution, supported by the votes of a majority of all the members thereof, that it has no confidence in the Government, the President may remove the Prime Minister from office: Provided that the President shall not do so unless three days have elapsed and he has decided not to dissolve Parliament under article 76 of this Constitution."
    },
    {
      "paragraph": 2,
      "text": "(2) The office of Prime Minister shall also become vacant -"
    },
    {
      "paragraph": 3,
      "text": "(a) when, after any dissolution of Parliament, the Prime Minister is informed by the President that the President is about to re-appoint him as Prime Minister or to appoint another person as Prime Minister;"
    },
    {
      "paragraph": 4,
      "text": "(b) if he ceases to be a member of the House of Representatives otherwise than by a dissolution of Parliament; or"
    },
    {
      "paragraph": 5,
      "text": "(c) if, under the provisions of sub-article (2) of article 55 of this Constitution, he is required to cease to perform his functions as a member of the House of Representatives."
    },
    {
      "paragraph": 6,
      "text": "(3) The office of a Minister, other than the office of Prime Minister shall become vacant -"
    },
    {
      "paragraph": 7,
      "text": "(a) upon the appointment or re-appointment of any person to the office of Prime Minister;"
    },
    {
      "paragraph": 8,
      "text": "(b) if his appointment to his office is revoked by the President, acting in accordance with the advice of the Prime Minister;"
    },
    {
      "paragraph": 9,
      "text": "(c) if he ceases to be a member of the House of Representatives otherwise than by a dissolution of Parliament; or"
    },
    {
      "paragraph": 10,
      "text": "(d) if, under the provisions of sub-article (2) of article 55 of this Constitution, he is required to cease to perform his functions as a member of the House of Representatives."
    }
  ],
  "amendmentHistory": {
    "date": "1974",
    "description": "Amended by Act LVIII of 1974",
    "legalReference": "LVIII.1974.34"
  },
  "crossReferences": [
    {
      "article": 76,
      "articleNumber": "76",
      "chapterNumber": "6",
      "description": "Dissolution of Parliament"
    },
    {
      "article": 55,
      "articleNumber": "55",
      "chapterNumber": "6",
      "description": "Tenure of office of members"
    }
  ],
  "notes": "This article outlines the circumstances under which the offices of Prime Minister and other Ministers may become vacant."
} 