{
  "number": 90,
  "title": "Leader of the Opposition",
  "chapterNumber": 7,
  "chapterTitle": "The Executive",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be a Leader of the Opposition who shall be appointed by the President."
    },
    {
      "paragraph": 2,
      "text": "(2) Whenever there shall be occasion for the appointment of a Leader of the Opposition, the President shall appoint -"
    },
    {
      "paragraph": 3,
      "text": "(a) if there is one opposition party whose numerical strength in the House of Representatives is greater than the strength of any other opposition party, the member of the House of Representatives who is the Leader of that party; or"
    },
    {
      "paragraph": 4,
      "text": "(b) if, by reason of an equality in the numerical strength of the opposition parties in the House or by reason that there is no opposition party, no person is qualified for appointment under paragraph (a) of this sub-article, the member of the House who, in the judgment of the President, commands the support of the largest single group of members of the House in opposition to the Government who are prepared to support one leader."
    },
    {
      "paragraph": 5,
      "text": "(3) The office of Leader of the Opposition shall become vacant -"
    },
    {
      "paragraph": 6,
      "text": "(a) if after any dissolution of Parliament, he is informed by the President that the President is about to appoint another person as Leader of the Opposition;"
    },
    {
      "paragraph": 7,
      "text": "(b) if he ceases to be a member of the House of Representatives otherwise than by a dissolution of Parliament;"
    },
    {
      "paragraph": 8,
      "text": "(c) if, under the provisions of sub-article (2) of article 55 of this Constitution, he is required to cease to perform his functions as a member of the House of Representatives; or"
    },
    {
      "paragraph": 9,
      "text": "(d) if his appointment is revoked under the provisions of sub-article (4) of this article."
    },
    {
      "paragraph": 10,
      "text": "(4) If, in the judgment of the President, a member of the House of Representatives other than the Leader of the Opposition, has become the Leader in the House of the opposition party having the greatest numerical strength in the House or, as the case may be, the Leader of the Opposition has ceased to command the support of the largest single group of members in opposition to the Government, the President shall revoke the appointment of the Leader of the Opposition."
    },
    {
      "paragraph": 11,
      "text": "(5) Sub-article (4) of this article shall not have effect while Parliament is dissolved."
    }
  ],
  "amendmentHistory": {
    "date": "1974",
    "description": "Amended by Act LVIII of 1974",
    "legalReference": "LVIII.1974.42"
  },
  "crossReferences": [
    {
      "article": 55,
      "articleNumber": "55",
      "chapterNumber": "6",
      "description": "Tenure of office of members"
    }
  ],
  "notes": "This article establishes the office of Leader of the Opposition, outlines the process for appointment, and specifies when the office becomes vacant."
} 