{
  "number": "91A",
  "title": "State Advocate",
  "chapterNumber": 7,
  "chapterTitle": "The Executive",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be a State Advocate whose office shall be a public office and who shall be appointed by the President acting in accordance with the advice of the Prime Minister."
    },
    {
      "paragraph": 2,
      "text": "(2) A person shall not be qualified to hold office as State Advocate unless he is qualified for appointment as a judge of the Superior Courts."
    },
    {
      "paragraph": 3,
      "text": "(3) The State Advocate shall be the advisor to Government in matters of law and legal opinion. He shall act in the public interest and shall safeguard the legality of State action. The State Advocate shall also perform such other duties and functions as may be conferred upon him by this Constitution or by any law. In the exercise of his functions, the State Advocate shall act in his individual judgment and he shall not be subject to the direction or control of any other person or authority."
    },
    {
      "paragraph": 4,
      "text": "(4) Subject to the provisions of sub-article (5), the State Advocate shall vacate his office when he attains the age of sixty-five (65) years."
    },
    {
      "paragraph": 5,
      "text": "(5) The State Advocate shall not be removed from office except by the President upon an address by the House supported by the votes of not less than two-thirds of all the members thereof and requesting such removal on the ground of proved inability to perform the functions of office (whether arising from infirmity of body or mind or any other cause) or proved misbehaviour."
    },
    {
      "paragraph": 6,
      "text": "(6) Parliament may by law regulate the procedure for the presentation of an address and for the investigation and proof of the inability or misbehaviour under the provisions of the last preceding sub-article."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Added by Act XXV of 2019, amended by Act XLV of 2020",
    "legalReference": "XXV.2019.10; XLV.2020.4"
  },
  "crossReferences": [],
  "notes": "This article establishes the office of the State Advocate, separate from the Attorney General, as the legal advisor to the Government. It also outlines the qualifications required and the circumstances under which the State Advocate may be removed from office."
} 