{
  "number": 85,
  "title": "Exercise of functions of President",
  "chapterNumber": 7,
  "chapterTitle": "The Executive",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) In the exercise of his functions the President shall act in accordance with the advice of the Cabinet or a Minister acting under the general authority of the Cabinet except in cases where he is required by this Constitution or any other law to act in accordance with the advice of any person or authority other than the Cabinet: Provided that the President shall act in accordance with his own deliberate judgment in the performance of the following functions-"
    },
    {
      "paragraph": 2,
      "text": "(a) in the exercise of the powers relating to the dissolution of Parliament conferred upon him by the proviso to sub-article (5) of article 76 of this Constitution;"
    },
    {
      "paragraph": 3,
      "text": "(b) in the exercise of the power to appoint the Prime Minister or remove the Prime Minister from office conferred upon him by article 80 and sub-article (1) of article 81 of this Constitution;"
    },
    {
      "paragraph": 4,
      "text": "(c) in the exercise of the powers conferred upon him by article 83 of this Constitution (which relates to the performance of the functions of the Prime Minister during absence, vacation or illness) in the circumstances described in the proviso to sub-article (2)of that article;"
    },
    {
      "paragraph": 5,
      "text": "(d) in the exercise of the power to appoint the Leader of the Opposition and to revoke any such appointment conferred upon him by article 90 of this Constitution; and"
    },
    {
      "paragraph": 6,
      "text": "(e) in signifying his approval for the purposes of sub-article (4) of article 110 of this Constitution of an appointment to an office on his personal staff;"
    },
    {
      "paragraph": 7,
      "text": "(f) in the exercise of the power conferred by this Constitution to make appointment to any office under this Constitution."
    },
    {
      "paragraph": 8,
      "text": "(2) Where by this Constitution the President is required to act in accordance with the advice of any person or authority, the question whether he has in any case received, or acted in accordance with, such advice shall not be enquired into in any court."
    },
    {
      "paragraph": 9,
      "text": "(3) The reference in sub-article (1) of this article to the functions of the President shall be construed as a reference to his powers and duties in the exercise of the executive authority of Malta and to any other powers and duties conferred or imposed on him as President by or under this Constitution or any other law."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Amended by Acts LVIII of 1974 and XLIV of 2020",
    "legalReference": "LVIII.1974.38; XLIV.2020.4"
  },
  "crossReferences": [
    {
      "article": 76,
      "articleNumber": "76",
      "chapterNumber": "6",
      "description": "Dissolution of Parliament"
    },
    {
      "article": 80,
      "articleNumber": "80",
      "chapterNumber": "7",
      "description": "Appointment of Ministers"
    },
    {
      "article": 81,
      "articleNumber": "81",
      "chapterNumber": "7",
      "description": "Tenure of office of Ministers"
    },
    {
      "article": 83,
      "articleNumber": "83",
      "chapterNumber": "7",
      "description": "Acting Prime Minister"
    },
    {
      "article": 90,
      "articleNumber": "90",
      "chapterNumber": "7",
      "description": "Leader of the Opposition"
    },
    {
      "article": 110,
      "articleNumber": "110",
      "chapterNumber": "10",
      "description": "President's staff"
    }
  ],
  "notes": "This article outlines when the President must act on the advice of the Cabinet or another authority, and when the President may exercise their own judgment."
} 