{
  "number": 91,
  "title": "Attorney General",
  "chapterNumber": 7,
  "chapterTitle": "The Executive",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be an Attorney General whose office shall be a public office and who shall be appointed by the President acting in accordance with the advice of the Prime Minister."
    },
    {
      "paragraph": 2,
      "text": "(2) A person shall not be qualified to hold office as Attorney General unless he is qualified for appointment as a judge of the Superior Courts."
    },
    {
      "paragraph": 3,
      "text": "(3) In the exercise of his powers to institute, undertake and discontinue criminal proceedings and of any other powers conferred on him by any law in terms which authorise him to exercise that power in his individual judgment the Attorney General shall have Constitutional independence and shall not be subject to the direction or control of any other person or authority except insofar as a law may provide:"
    },
    {
      "paragraph": 4,
      "text": "(a) for the judicial review of a decision not to prosecute or of any other decision taken by the Attorney General, on the grounds of illegality or unreasonableness; or"
    },
    {
      "paragraph": 5,
      "text": "(b) for the judicial review on the basis of criteria established by law of a decision of the Attorney General that a prosecution should take place in a superior court of criminal jurisdiction where the punishment applicable would be higher than that which would apply had the same offence been tried before an inferior court of criminal jurisdiction."
    },
    {
      "paragraph": 6,
      "text": "(4) Subject to the provisions of sub-article (5) of this article, the Attorney General shall vacate his office when he attains the age of sixty-five years."
    },
    {
      "paragraph": 7,
      "text": "(5) The Attorney General shall not be removed from his office except by the President upon an address by the House supported by the votes of not less than two-thirds of all the members thereof and requesting such removal on the grounds of proved inability to perform the functions of his office (whether arising from infirmity of body or mind or any other cause) or proved misbehaviour."
    },
    {
      "paragraph": 8,
      "text": "(6) Parliament may by law regulate the procedure for the presentation of an address and for the investigation and proof of the inability or misbehaviour under the provisions of the last preceding sub-article."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Amended by Acts LVIII of 1974, XIV of 2007, XLV of 2020, and XLI of 2020",
    "legalReference": "LVIII.1974.43; XIV.2007.4; XLV.2020.3; XLI.2020.3"
  },
  "crossReferences": [],
  "notes": "This article establishes the office of the Attorney General, the qualifications required, the independence of the office, and the circumstances under which the Attorney General may be removed from office."
} 