{
  "number": 86,
  "title": "Exercise of Prime Minister's functions",
  "chapterNumber": 7,
  "chapterTitle": "The Executive",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Where by this Constitution the Prime Minister is required to exercise any function on the recommendation of any person or authority he shall exercise that function in accordance with such recommendation: Provided that -"
    },
    {
      "paragraph": 2,
      "text": "(a) before he acts in accordance therewith he may once refer that recommendation back for reconsideration by the person or authority concerned; and"
    },
    {
      "paragraph": 3,
      "text": "(b) if that person or authority, having reconsidered the original recommendation under the preceding paragraph, substitutes therefor a different recommendation, the provisions of this sub-article shall apply to that different recommendation as they apply to the original recommendation."
    },
    {
      "paragraph": 4,
      "text": "(2) Where by this Constitution the Prime Minister is required to perform any function after consultation with any person or authority, he shall not be obliged to perform that function in accordance with the advice of that person or authority."
    },
    {
      "paragraph": 5,
      "text": "(3) Where by this Constitution the Prime Minister is required to perform any function in accordance with the recommendation of, or after consultation with, any person or authority, the question whether he has in any case received, or acted in accordance with such recommendation or whether he has consulted with such person or authority shall not be enquired into in any court."
    },
    {
      "paragraph": 6,
      "text": "(4) Where by this Constitution the Prime Minister is required to perform the functions listed in articles 120(2), (6) and (7), he shall do so after acting on such advice as might have been given in that respect by the Cabinet of Ministers."
    }
  ],
  "amendmentHistory": {
    "date": "2021",
    "description": "Amended by Act XII of 2021",
    "legalReference": "XII.2021.3"
  },
  "crossReferences": [
    {
      "article": 120,
      "articleNumber": "120",
      "chapterNumber": "11",
      "description": "Functions of Public Service Commission"
    }
  ],
  "notes": "This article outlines the procedures for how the Prime Minister exercises functions on recommendation of, or after consultation with, other authorities."
} 