{
  "number": 92,
  "title": "Permanent Secretaries and heads of government departments",
  "chapterNumber": 7,
  "chapterTitle": "The Executive",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Where any Minister has been charged with responsibility for any department of government, he shall exercise general direction and control over that department; and, subject to such direction and control, the department may be under the supervision of a Permanent Secretary: Provided that two or more departments of government may be placed under the supervision of one Permanent Secretary."
    },
    {
      "paragraph": 2,
      "text": "(2) The Prime Minister shall be responsible for assigning departments of government to Permanent Secretaries."
    },
    {
      "paragraph": 3,
      "text": "(3) Power to appoint public officers to hold or act in the office of Permanent Secretary and to remove from office persons holding or acting in such office shall vest in the President of Malta acting in accordance with the advice of the Public Service Commission: Provided that the Public Service Commission shall give its advice to the President after having received and evaluated the recommendation given by the Principal Permanent Secretary."
    },
    {
      "paragraph": 4,
      "text": "(4) Heads of departments of government other than those whose manner of appointment is specifically provided for in this Constitution shall be appointed from amongst senior public officers by the Prime Minister acting after consultation with the Public Service Commission: Provided that notwithstanding the provisions of this sub-article the appointment of the Commissioner of Police shall be made by the Prime Minister after consultation with the Public Service Commission as may be provided in the Police Act."
    },
    {
      "paragraph": 5,
      "text": "(5) The Principal Permanent Secretary shall be appointed in the same manner as a Permanent Secretary from amongst persons having the qualifications to be so appointed in terms of sub-articles (1), (2) and (3): Provided that the power to appoint the Principal Permanent Secretary shall vest in the President acting in accordance with the advice of the Cabinet of Ministers and after consulting the Public Service Commission: Provided further that the functions of the Principal Permanent Secretary together with any other matter ancillary or incidental or considered necessary or expedient for the carrying out of the functions of the Principal Permanent Secretary shall be provided for by an Act of Parliament."
    }
  ],
  "amendmentHistory": {
    "date": "2021",
    "description": "Amended by Acts LVIII of 1974, III of 2019, XIX of 2020, and XXVI of 2021",
    "legalReference": "LVIII.1974.44; III.2019.40; XIX.2020.3; XXVI.2021.2"
  },
  "crossReferences": [
    {
      "reference": "Police Act",
      "description": "Cap. 164"
    }
  ],
  "notes": "This article outlines the relationship between Ministers and their departments, the role of Permanent Secretaries, and the appointment procedures for Permanent Secretaries and heads of government departments, including the Principal Permanent Secretary."
} 