{
  "number": 93,
  "title": "Prerogative of mercy",
  "chapterNumber": 7,
  "chapterTitle": "The Executive",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) The President shall have power to -"
    },
    {
      "paragraph": 2,
      "text": "(a) grant to any person concerned in or convicted of any offence a pardon, either free or subject to lawful conditions;"
    },
    {
      "paragraph": 3,
      "text": "(b) grant to any person a respite, either indefinite or for a specified period, of the execution of any sentence passed on that person for any offence;"
    },
    {
      "paragraph": 4,
      "text": "(c) substitute a less severe form of punishment for any punishment imposed on any person for any offence; or"
    },
    {
      "paragraph": 5,
      "text": "(d) remit the whole or part of any sentence passed on any person for an offence or for any penalty or forfeiture otherwise due to the State on account of any offence."
    },
    {
      "paragraph": 6,
      "text": "(2) (a) Where any person has been sentenced to death by any court in Malta, the President shall cause a written report of the case from the trial judge, or, in the case of a court-martial the person presiding, and such other information derived from the record of the case or elsewhere as the President may require, to be sent to the Minister responsible for justice."
    },
    {
      "paragraph": 7,
      "text": "(b) The said Minister shall send such written report and information (if any) to the Cabinet, and the Cabinet shall advise the President whether he should grant the offender a pardon or respite in the exercise of the powers conferred on him by this article."
    }
  ],
  "amendmentHistory": {
    "date": "1974",
    "description": "Amended by Act LVIII of 1974",
    "legalReference": "LVIII.1974.45"
  },
  "crossReferences": [],
  "notes": "This article outlines the President's powers to grant pardons, respites, or reduce sentences, and the procedure to be followed in cases of death sentences."
} 