{
  "number": 48,
  "title": "Establishment of the office of President",
  "chapterNumber": 5,
  "chapterTitle": "The President",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be a President of Malta who shall be appointed by Resolution supported by the votes of not less than two-thirds of all the members of the House: Provided that notwithstanding the provisions of sub-article (3)(a), if the Resolution is not supported by the votes of not less than two-thirds of all the members of the House, the person occupying the office of the President of Malta shall, in any circumstance, remain in office until the Resolution is supported by the votes of not less than two-thirds of all the members of the House."
    },
    {
      "paragraph": 2,
      "text": "(2) A person shall not be qualified to be appointed to the office of President if -"
    },
    {
      "paragraph": 3,
      "text": "(a) he is not a citizen of Malta; or"
    },
    {
      "paragraph": 4,
      "text": "(b) he holds or has held the office of Chief Justice or other Judge of the Superior Courts; or"
    },
    {
      "paragraph": 5,
      "text": "(c) he is not eligible for appointment to or to act in any public office in accordance with articles 109, 118 and 120 of this Constitution."
    },
    {
      "paragraph": 6,
      "text": "(3) The office of President shall become vacant -"
    },
    {
      "paragraph": 7,
      "text": "(a) on the expiration of five years from the date of the appointment to that office; or"
    },
    {
      "paragraph": 8,
      "text": "(b) if the holder of the office is removed upon an address by the House supported by the votes of not less than two-thirds of all the members thereof and praying for such removal on the grounds of proved inability to perform functions of his office (whether arising from infirmity of body or mind or any other cause) or proved misbehaviour: Provided that Parliament may by law regulate the procedure for the presentation of an address and for the investigation and proof of the inability or misbehaviour of the holder of the office under the provisions of this paragraph."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Amended by Acts LVIII of 1974 and XLIV of 2020",
    "legalReference": "LVIII.1974.18; XLIV.2020.2"
  },
  "crossReferences": [
    {
      "article": 109,
      "articleNumber": "109",
      "chapterNumber": "10",
      "description": "Eligibility for public office"
    },
    {
      "article": 118,
      "articleNumber": "118",
      "chapterNumber": "11",
      "description": "Eligibility for public office"
    },
    {
      "article": 120,
      "articleNumber": "120",
      "chapterNumber": "11",
      "description": "Eligibility for public office"
    }
  ],
  "notes": "Note: sub-article (4) of this article has been omitted as it has had its effect."
} 