{
  "number": 69,
  "title": "Oath to be taken by members of House of Representatives",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "partNumber": 2,
  "partTitle": "Powers and Procedure of Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) No member of the House of Representatives shall be permitted to take part in the proceedings of the House (other than proceedings necessary for the purposes of this article) until he has taken and subscribed before the House the oath of allegiance:"
    },
    {
      "paragraph": 2,
      "text": "Provided that the election of the Speaker and Deputy Speaker of the House may take place before the members of the House have taken and subscribed such oath."
    },
    {
      "paragraph": 3,
      "text": "(2) If, during the first sitting of the House of Representatives after any general election, a member who is present refuses or otherwise fails immediately to take and subscribe the oath of allegiance, then the House shall proceed to elect from among the members a person who is willing to take and subscribe such oath, to be the Speaker."
    },
    {
      "paragraph": 4,
      "text": "(3) If, between the time of any general election and the first sitting of the House of Representatives thereafter, any person who, as a result of the election, is entitled to be a member of that House, submits to the Clerk of the House a declaration signed by him that he is willing immediately to take and subscribe the oath of allegiance, the Clerk shall notify the members accordingly and shall convene as soon as practicable a special sitting of the House for the purpose of allowing such person to take and subscribe that oath."
    },
    {
      "paragraph": 5,
      "text": "(4) If at any time after the first sitting of the House of Representatives any member who has not previously taken and subscribed the oath of allegiance submits to the Speaker a declaration signed by him that he is willing immediately to take and subscribe that oath, the Speaker shall notify the members accordingly and shall as soon as practicable during the next sitting of the House have such member called upon to take and subscribe that oath."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [],
  "notes": "This article establishes the requirement for members of the House of Representatives to take an oath of allegiance before participating in proceedings, with provisions for special sittings to administer the oath and exceptions for the election of the Speaker and Deputy Speaker."
} 