{
  "number": 68,
  "title": "Regulation of procedure in House of Representatives",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "partNumber": 2,
  "partTitle": "Powers and Procedure of Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Subject to the provisions of this Constitution, the House of Representatives may regulate its own procedure."
    },
    {
      "paragraph": 2,
      "text": "(2) The House of Representatives may act notwithstanding any vacancy in its membership (including any vacancy not filled when the House first meets after any general election) and the presence or participation of any person not entitled to be present at or to participate in the proceedings of the House shall not invalidate those proceedings."
    },
    {
      "paragraph": 3,
      "text": "(3) Any provision made in pursuance of sub-article (1) of this article for a quorum shall provide that it shall comprise not less than twelve members of the House."
    },
    {
      "paragraph": 4,
      "text": "(4) The House of Representatives shall elect at its first sitting, and when necessary subsequently, a Deputy Speaker from amongst its members, who shall be the first person who shall take the place of the Speaker whenever the Speaker's seat is vacant, when the Speaker is absent from Malta or when, for the purpose of addressing the House of Representatives or for any other reason, the Speaker is not occupying his seat in Parliament as the Speaker. The Deputy Speaker shall also preside at sittings of the House of Representatives when the Speaker is not present."
    },
    {
      "paragraph": 5,
      "text": "(5) The Deputy Speaker shall, notwithstanding that he is acting as Speaker, have the right to exercise his vote in the first instance and not be restricted to a casting vote."
    },
    {
      "paragraph": 6,
      "text": "(6) When neither the Speaker nor the Deputy Speaker is present at a sitting of the House of Representatives, a member of the House may be elected by the House to preside at that sitting with the powers of the Deputy Speaker."
    }
  ],
  "amendmentHistory": {
    "date": "2003-07-16",
    "description": "Amendment regarding the Deputy Speaker's voting rights",
    "legalReference": "Act XIII of 2003"
  },
  "crossReferences": [],
  "notes": "This article provides for the House of Representatives to regulate its own procedure, establishes quorum requirements, and outlines the process for electing and the powers of the Deputy Speaker, including their right to vote."
} 