{
  "number": 61,
  "title": "Electoral Commission",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "partNumber": 1,
  "partTitle": "Composition of Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be an Electoral Commission for Malta."
    },
    {
      "paragraph": 2,
      "text": "(2) The Electoral Commission shall consist of a Chairman, who shall be the person for the time being holding the office of Chief Electoral Commissioner and who shall be appointed to that office from the public service, and such number of members not being less than four as may be prescribed by any law for the time being in force in Malta."
    },
    {
      "paragraph": 3,
      "text": "(3) The members of the Electoral Commission shall be appointed by the President, acting in accordance with the advice of the Prime Minister, given after he has consulted the Leader of the Opposition."
    },
    {
      "paragraph": 4,
      "text": "(4) A person shall not be qualified to hold office as a member of the Electoral Commission if he is a Minister, a Parliamentary Secretary, a member of, or a candidate for election to, the House of Representatives or a public officer."
    },
    {
      "paragraph": 5,
      "text": "(5) Subject to the provisions of this article, a member of the Electoral Commission shall vacate his office -"
    },
    {
      "paragraph": 6,
      "text": "(a) at the expiration of three years from the date of his appointment or at such earlier time as may be specified in the instrument by which he was appointed; or"
    },
    {
      "paragraph": 7,
      "text": "(b) if any circumstances arise that, if he were not a member of the Commission, would cause him to be disqualified for appointment as such."
    },
    {
      "paragraph": 8,
      "text": "(6) Subject to the provisions of sub-article (7) of this article, the Electoral Commission shall not be subject to the direction or control of any other person or authority and shall conduct the elections to the House of Representatives and to local councils and the voting at referenda."
    },
    {
      "paragraph": 9,
      "text": "(7) Parliament may make provision for procedures pursuant to which the Electoral Commission may be called upon by a candidate to reconsider any decision given by it in the carrying out of its functions in accordance with the provisions of this article, and Parliament may make provision for determining the procedure in accordance with which such reconsiderations may be made."
    },
    {
      "paragraph": 10,
      "text": "(8) Notwithstanding the provisions of article 60(3) of this Constitution, the administrative secretariat and organization of the Electoral Commission, however named, shall fall under the responsibility of the Electoral Commission which shall be empowered to appoint, discipline and remove all officers and employees of such secretariat who shall, for all intents and purposes, be considered to be officers and employees of the Commission acting through such secretariat, which shall also be responsible for all expenses, records and business of the Electoral Commission."
    }
  ],
  "amendmentHistory": {
    "date": "2020-07-29",
    "description": "Amendment regarding the administrative secretariat and organization of the Electoral Commission",
    "legalReference": "Act XLIII of 2020"
  },
  "crossReferences": [
    {
      "article": "60",
      "description": "Clerk to House of Representatives and his staff"
    }
  ],
  "notes": "This article establishes the Electoral Commission, its composition, appointment process, and independence in conducting elections for the House of Representatives, local councils, and referenda. It also provides for the administrative structure and accountability of the Commission."
} 