{
  "number": 52,
  "title": "Composition of the House of Representatives",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Subject to the provisions of this article, the House of Representatives shall consist of such number of members, being an odd number and divisible by the number of electoral divisions, as Parliament may from time to time by law determine."
    },
    {
      "paragraph": 2,
      "text": "(2) Any such law shall ensure, as far as possible, that the political party or, where more than one political party is represented in the House of Representatives, the political party which gains a majority of all the valid votes cast at a general election will be represented in the House of Representatives by a majority of all the members thereof."
    },
    {
      "paragraph": 3,
      "text": "(3) The members of the House of Representatives shall be elected in such manner as may be determined from time to time by or under any law for the time being in force in Malta upon the principle of proportional representation (hereinafter referred to as \"the proportional representation principle\") by means of the single transferable vote (hereinafter referred to as \"the single transferable vote principle\") and by persons registered as voters in accordance with any such law as may from time to time be in force for such purpose."
    },
    {
      "paragraph": 4,
      "text": "(4) The members of the House of Representatives shall be known as Members of Parliament and shall be elected from such electoral divisions, being an even number of not more than fifteen and not less than nine, as Parliament may from time to time by law determine."
    },
    {
      "paragraph": 5,
      "text": "(5) Each electoral division shall return such number of Members of Parliament, being not less than five and not more than seven, as Parliament may from time to time by law determine, so however that such number shall be the same for all electoral divisions."
    },
    {
      "paragraph": 6,
      "text": "(6) At any general election candidates who are returned as Members of Parliament may only be so returned from one electoral division, being the division in respect of which they are candidates."
    },
    {
      "paragraph": 7,
      "text": "(7) Any law which determines the number of members of the House of Representatives or establishes the number of electoral divisions or makes provision for the purposes of subarticle (4) or sub-article (5) of this article shall be passed by not less than two-thirds of all the members of the House."
    },
    {
      "paragraph": 8,
      "text": "(8) In this article, and in articles 56, 57 and 58 of this Constitution, \"general election\" means a general election held for the election of all the members of the House of Representatives in accordance with the provisions of article 76 of this Constitution."
    }
  ],
  "amendmentHistory": {
    "date": "2007-09-28",
    "description": "Amendment to provisions on composition of the House of Representatives",
    "legalReference": "Act XXI of 2007"
  },
  "crossReferences": [
    {
      "article": "56",
      "description": "Voting at elections"
    },
    {
      "article": "57",
      "description": "Qualification of voters"
    },
    {
      "article": "58",
      "description": "Disqualification of voters"
    },
    {
      "article": "76",
      "description": "Prorogation and dissolution of Parliament"
    }
  ],
  "notes": "This article establishes the composition of the House of Representatives and defines the electoral system based on proportional representation and the single transferable vote."
} 