{
  "number": "52A",
  "title": "Additional seats for under-represented sex",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) A law made pursuant to article 52(1) of this Constitution shall also ensure that, as far as possible, there shall be a fair representation of both sexes in Parliament."
    },
    {
      "paragraph": 2,
      "text": "(2) Where one sex is represented by less than forty per centum of the total number of elected members, the law shall provide for a mechanism which shall come into effect for one legislature only and which shall be aimed at increasing the number of members of the under-represented sex up to a maximum of twelve additional seats."
    },
    {
      "paragraph": 3,
      "text": "(3) The additional seats referred to in sub-article (2) shall be filled as follows:"
    },
    {
      "paragraph": 4,
      "text": "(a) by those candidates of the under-represented sex who were not elected but who obtained the highest percentage of votes without being elected from any one party; or"
    },
    {
      "paragraph": 5,
      "text": "(b) in the case where the candidates of the under-represented sex who were not elected did not obtain a percentage of votes as provided for in paragraph (a), or where there were not enough non-elected candidates from the under-represented sex, by a casual election process from amongst candidates of the under-represented sex chosen by the parties."
    },
    {
      "paragraph": 6,
      "text": "(4) The additional seats shall be allocated to the political parties in a manner which is proportional to the number of first count votes obtained by each party at the general election."
    },
    {
      "paragraph": 7,
      "text": "(5) The provisions of article 54, article 55 and article 56 of this Constitution shall apply, as applicable, to candidates elected to fill the additional seats and candidates contesting in casual elections to fill a vacant additional seat."
    }
  ],
  "amendmentHistory": {
    "date": "2021",
    "description": "Added to provide for additional seats for under-represented sex in Parliament",
    "legalReference": "Act XLIV of 2021"
  },
  "crossReferences": [
    {
      "article": "52",
      "description": "Composition of the House of Representatives"
    },
    {
      "article": "54",
      "description": "Disqualifications for membership"
    },
    {
      "article": "55",
      "description": "Tenure of office of members"
    },
    {
      "article": "56",
      "description": "Voting at elections"
    }
  ],
  "notes": "This article establishes a mechanism to increase representation of the under-represented sex in Parliament through additional seats when one sex is represented by less than 40% of elected members."
} 