{
  "number": 59,
  "title": "Voting at elections",
  "chapterNumber": 5,
  "chapterTitle": "Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) The members of the House of Representatives shall be elected in such manner as ensures that the political party or partnership which obtains more than fifty per centum of all valid votes cast at a general election shall obtain a number of seats in the House which is greater than the aggregate number of seats obtained by all other parties."
    },
    {
      "paragraph": 2,
      "text": "(2) Where a political party or partnership obtains more than fifty per centum of all valid votes cast at a general election it shall be entitled, by virtue of this sub-article and without the necessity of any further provision, to such number of seats in the House of Representatives in addition to the seats obtained under any other provision of this Constitution which would result in that party or partnership having a number of seats in the House which is greater than the aggregate number of seats obtained by all other parties by one seat, where the obtaining of a greater number of votes constitutes a difference of at least one per centum. Where the difference exceeds one per centum, that party or partnership shall for every one per centum additional difference be entitled to one further additional seat; but where after the allocation of all additional seats under this sub-article a party or partnership shall not have a number of seats which is greater than the aggregate number of seats obtained by all other parties, that party or partnership shall be entitled to such further seat or seats as would result in that party or partnership having a number of seats which is greater by one than the aggregate number of seats obtained by all other parties."
    },
    {
      "paragraph": 3,
      "text": "(3) Notwithstanding the provisions of article 52 of this Constitution (which requires decisions of the House of Representatives to be taken by a majority of the votes of the members present and voting) Parliament shall, when making law relating to the system of elections to the House, provide that where political parties or partnerships have filed an equal number of candidates who have been returned as members of the House in accordance with such law, the House may proceed with the transaction of business only if it is constituted in such a way as not to affect the relative equality of representation in the House of those parties or partnerships."
    },
    {
      "paragraph": 4,
      "text": "(4) The provisions of sub-article (1) of this article shall come into force on the 30th September, 1987, with respect to any seats in the House of Representatives after a dissolution of Parliament which takes place after the 30th September, l987; and all references in this Constitution or in any other law which directly or indirectly refer to such sub-article shall be construed accordingly."
    },
    {
      "paragraph": 5,
      "text": "(5) The provisions of sub-article (2) of this article shall come into force upon the dissolution of Parliament following the elections of representatives to the House returned after the lst August, 2007, and the provisions of sub- article (3) of this article and of this sub-article shall come into force upon the passing of the Act introducing them into this Constitution."
    }
  ],
  "amendmentHistory": [
    {
      "date": "1987-07-31",
      "description": "Amendment regarding majority party representation",
      "legalReference": "Act LVIII of 1987"
    },
    {
      "date": "2007-09-28",
      "description": "Amendment regarding allocation of additional seats to party with majority of votes",
      "legalReference": "Act XXI of 2007"
    }
  ],
  "crossReferences": [
    {
      "article": 52,
      "description": "Reference to decisions of the House of Representatives"
    }
  ],
  "notes": "This article establishes the principles for ensuring that the political party that obtains a majority of votes in a general election obtains a majority of seats in the House of Representatives, and provides for the allocation of additional seats to achieve this outcome."
} 