{
  "number": 65,
  "title": "Power to make laws",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "partNumber": 2,
  "partTitle": "Powers and Procedure of Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Subject to the provisions of this Constitution, Parliament may make laws for the peace, order and good government of Malta in conformity with full respect for human rights, generally accepted principles of international law and Malta's international and regional obligations in particular those assumed by the treaty of accession to the European Union signed in Athens on the 16th April, 2003."
    },
    {
      "paragraph": 2,
      "text": "(2) Without prejudice to the generality of sub-article (1) and subject to the provisions of sub-articles (3), (4) and (5) of this article, Parliament may by law determine the privileges, immunities and powers of the House of Representatives and the members thereof."
    },
    {
      "paragraph": 3,
      "text": "(3) No civil or criminal proceedings may be instituted against any member of the House of Representatives for words spoken before, or written in a report to, the House or a committee thereof or by reason of any matter or thing brought by him therein by petition, bill, resolution, motion or otherwise."
    },
    {
      "paragraph": 4,
      "text": "(4) For the duration of any session members of the House of Representatives shall enjoy freedom from arrest for any civil debt except a debt the contraction of which constitutes a criminal offence."
    },
    {
      "paragraph": 5,
      "text": "(5) No process issued by any court in the exercise of its civil jurisdiction shall be served or executed within the precincts of the House of Representatives while the House is sitting or through the Speaker, the Clerk or any officer of the House."
    }
  ],
  "amendmentHistory": {
    "date": "2003-07-16",
    "description": "Amendment to include reference to human rights, international law and EU obligations",
    "legalReference": "Act XIII of 2003"
  },
  "crossReferences": [],
  "notes": "This article establishes Parliament's power to make laws for the peace, order, and good government of Malta, while respecting human rights and international obligations. It also provides for the privileges and immunities of the members of the House of Representatives."
} 