{
  "number": 77,
  "title": "Prorogation and dissolution of Parliament",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) The President may at any time by proclamation prorogue or dissolve Parliament."
    },
    {
      "paragraph": 2,
      "text": "(2) Subject to the provisions of sub-article (3) of this article, Parliament, unless sooner dissolved, shall continue for five years from the date of its first sitting after any dissolution and shall then stand dissolved."
    },
    {
      "paragraph": 3,
      "text": "(3) At any time when Malta is at war, Parliament may from time to time extend the period of five years specified in sub-article (2) of this article for not more than twelve months at a time:"
    },
    {
      "paragraph": 4,
      "text": "Provided that the life of Parliament shall not be extended under this sub-article for more than five years."
    },
    {
      "paragraph": 5,
      "text": "(4) If between a dissolution of Parliament and the next ensuing general election of members of the House of Representatives an emergency arises of such a nature that, in the opinion of the Prime Minister, it is necessary to recall Parliament, the President may by proclamation summon the Parliament that has been dissolved to meet, and that Parliament shall thereupon be deemed (except for the purposes of article 61, article 66 and article 76 of this Constitution) not to have been dissolved but shall be deemed (except as aforesaid) to be dissolved on the date on which the polls are held in the next ensuing general election."
    },
    {
      "paragraph": 6,
      "text": "(5) In the exercise of his powers under this article the President shall act in accordance with the advice of the Prime Minister:"
    },
    {
      "paragraph": 7,
      "text": "Provided that -"
    },
    {
      "paragraph": 8,
      "text": "(a) if the House of Representatives passes a resolution, supported by the votes of a majority of all the members thereof, that it has no confidence in the Government, and the Prime Minister does not within three days either resign from his office or advise a dissolution, the President may dissolve Parliament;"
    },
    {
      "paragraph": 9,
      "text": "(b) if the office of Prime Minister is vacant and the President considers that there is no prospect of his being able within a reasonable time to appoint to that office a person who can command the support of a majority of the members of the House of Representatives, the President may dissolve Parliament; and"
    },
    {
      "paragraph": 10,
      "text": "(c) if the Prime Minister recommends a dissolution and the President considers that the Government of Malta can be carried on without a dissolution and that a dissolution would not be in the interests of Malta, the President may refuse to dissolve Parliament."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [
    {
      "article": "61",
      "description": "Electoral Commission"
    },
    {
      "article": "66",
      "description": "Alteration of this Constitution"
    },
    {
      "article": "76",
      "description": "Sessions of Parliament"
    }
  ],
  "notes": "This article establishes the President's power to prorogue or dissolve Parliament, the normal five-year term of Parliament, provisions for extending Parliament's term during wartime, recalling a dissolved Parliament during emergencies, and the relationship between the President and Prime Minister regarding dissolution."
} 