{
  "number": "64A",
  "title": "Parliamentary Public Appointments Committee",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "partNumber": 1,
  "partTitle": "Composition of Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be a Committee, to be known as the Parliamentary Public Appointments Committee whose members shall be appointed by the President acting in accordance with a resolution of the House of Representatives supported by the votes of not less than two-thirds of all the members of the House."
    },
    {
      "paragraph": 2,
      "text": "(2) The Public Appointments Committee shall be composed of not more than five members of whom three shall constitute a quorum. The members appointed shall be chosen from amongst the members of the House of Representatives and shall be such as to fairly represent the House."
    },
    {
      "paragraph": 3,
      "text": "(3) The Public Appointments Committee shall from time to time, but at least once a year, present to the House of Representatives through the Leader of the House a report of its activities and the House shall debate such report within two months from the presentation of such report."
    },
    {
      "paragraph": 4,
      "text": "(4) The Public Appointments Committee shall -"
    },
    {
      "paragraph": 5,
      "text": "(a) conduct a hearing in respect of such public appointments as are referred to it by the Prime Minister; and"
    },
    {
      "paragraph": 6,
      "text": "(b) report to the Prime Minister on whether the Committee deems the person nominated to be appointed to a public office as being qualified for that office and having no conflict of interest."
    },
    {
      "paragraph": 7,
      "text": "(5) The Prime Minister shall be bound to refer to the Public Appointments Committee:"
    },
    {
      "paragraph": 8,
      "text": "(a) for a hearing in terms of sub-article (4), the appointments of Ambassadors and High Commissioners of Malta accredited to other countries or international organizations;"
    },
    {
      "paragraph": 9,
      "text": "(b) nominations for chairpersons and members of constitutional bodies and bodies established by this Constitution; and"
    },
    {
      "paragraph": 10,
      "text": "(c) nominations to the boards of entities that by law or otherwise are required to be regulated by this Constitution."
    },
    {
      "paragraph": 11,
      "text": "(6) The Public Appointments Committee shall regulate its own procedure."
    }
  ],
  "amendmentHistory": {
    "date": "2020-07-29",
    "description": "Added to establish the Parliamentary Public Appointments Committee",
    "legalReference": "Act XLIII of 2020"
  },
  "crossReferences": [],
  "notes": "This article establishes the Parliamentary Public Appointments Committee, its composition, functions, and accountability mechanisms. The Committee is responsible for conducting hearings and providing reports on qualifications and potential conflicts of interest for various public appointments."
} 