{
  "number": 66,
  "title": "Alteration of this Constitution",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "partNumber": 2,
  "partTitle": "Powers and Procedure of Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) In this article -"
    },
    {
      "paragraph": 2,
      "text": "\"the appointed day\" means the date of commencement of this Constitution;"
    },
    {
      "paragraph": 3,
      "text": "\"law\" includes any instrument having the force of law and any unwritten rule of law."
    },
    {
      "paragraph": 4,
      "text": "(2) Subject to the provisions of this article, Parliament may alter any of the provisions of this Constitution and (in so far as it forms part of the law of Malta) any of the provisions of the Malta Independence Act, 1964."
    },
    {
      "paragraph": 5,
      "text": "(3) In so far as it alters -"
    },
    {
      "paragraph": 6,
      "text": "(a) this article; or"
    },
    {
      "paragraph": 7,
      "text": "(b) article 1, 2, 3(1), 5, 6, 32 to 48 (inclusive), 51, 52, 56, 57, 60, 61, 64, 65, 67, 68, 69, 73, 74, 75, 76, 77, 78, 80, 83, 84, 85, 86, 87, 90, 91, 95, 96, 102, 103, 109, 111, 112, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 126, 127, 128, 129, 144, 145 of this Constitution; or"
    },
    {
      "paragraph": 8,
      "text": "(c) article 23, 24, 30, 31, 41(2), 43, 50, 53, 55, 58, 59, 62, 63, 79, 89, or 113 in terms which are inconsistent with the requirements of the public interest in a democratic society; or"
    },
    {
      "paragraph": 9,
      "text": "(d) article 16 of the Malta Independence Act, 1964,"
    },
    {
      "paragraph": 10,
      "text": "a bill for an Act of Parliament under this article shall not be passed in the House of Representatives unless at the final voting thereon in that House it is supported by the votes of not less than two-thirds of all the members of the House."
    },
    {
      "paragraph": 11,
      "text": "(4) In so far as it alters -"
    },
    {
      "paragraph": 12,
      "text": "(a) this sub-article or sub-article (5) of this article; or"
    },
    {
      "paragraph": 13,
      "text": "(b) article 76, other than paragraph (b) thereof,"
    },
    {
      "paragraph": 14,
      "text": "a bill for an Act of Parliament under this article shall not be presented to the President for his assent unless not less than three nor more than six months after its passage through the House in the manner prescribed in sub-article (3) of this article it has been submitted to the electors qualified to vote for the election of members of the House of Representatives and the majority of the electors voting have approved the bill."
    },
    {
      "paragraph": 15,
      "text": "(5) The provisions of sub-article (4) of this article shall apply to a bill to alter sub-article (7) of article 56 or sub-article (7) of article 110 or to vary or repeal this sub-article:"
    },
    {
      "paragraph": 16,
      "text": "Provided that for the purpose of a bill to vary the provisions of the said sub-article (7) of article 56 in order that they shall require a majority greater than that fixed therein, the provisions of sub-article (4) of this article shall apply as if in place of the reference to a majority of the electors voting there were a reference to a majority consisting of so many of the electors voting as will constitute a majority of all registered electors."
    },
    {
      "paragraph": 17,
      "text": "(6) In this article references to any of the provisions of this Constitution or of the Malta Independence Act, 1964, include references to any law that amends or replaces that provision in terms which do not also provide for the alteration of this subarticle."
    },
    {
      "paragraph": 18,
      "text": "(7) In this article -"
    },
    {
      "paragraph": 19,
      "text": "(a) references to the alteration of any of the provisions of this Constitution or of the Malta Independence Act, 1964, include references to the amendment, modification or re-enactment, with or without amendment or modification, of that provision, the suspension or repeal of that provision and the making of a different provision in lieu of that provision;"
    },
    {
      "paragraph": 20,
      "text": "(b) references to the alteration of any of the provisions of this Constitution or of the Malta Independence Act, 1964, include references to the alteration of any law that alters that provision."
    },
    {
      "paragraph": 21,
      "text": "(8) No provision of this Constitution shall be deemed to allot to the House of Representatives a share in the legislative power greater than the share hitherto allotted to the House of Representatives constituted by Chapter VI of the Constitution of Malta."
    }
  ],
  "amendmentHistory": {
    "date": "2001-07-23",
    "description": "Amendment to update the list of articles requiring special majorities for amendment",
    "legalReference": "Act XIII of 2001"
  },
  "crossReferences": [
    {
      "article": "56",
      "description": "Voting at elections"
    },
    {
      "article": "110",
      "description": "Public Service Commission"
    }
  ],
  "notes": "This article establishes the procedures for amending the Constitution, specifying which articles require a two-thirds majority in Parliament, which require a referendum, and defining the terms 'alteration' and 'law' in the context of constitutional amendments."
} 