{
  "number": 52,
  "title": "Speaker and Deputy Speaker",
  "chapterNumber": 5,
  "chapterTitle": "Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) When the House of Representatives first meets after any general election and before it proceeds to the despatch of any other business, it shall elect a person to be Speaker of the House; and if the office of Speaker falls vacant at any time before the next dissolution of Parliament, the House shall, as soon as practicable, elect another person to that office."
    },
    {
      "paragraph": 2,
      "text": "(2) The Speaker may be elected either from among the members of the House of Representatives who are not Ministers or Parliamentary Secretaries or from among persons who are not members of the House."
    },
    {
      "paragraph": 3,
      "text": "(3) When the House of Representatives first meets after any general election and before it proceeds to the despatch of any other business except the election of the Speaker, the House shall elect a member of the House, who is not a Minister or a Parliamentary Secretary, to be Deputy Speaker of the House; and if the office of Deputy Speaker falls vacant at any time before the next dissolution of Parliament, the House shall, as soon as practicable, elect another such member to that office."
    },
    {
      "paragraph": 4,
      "text": "(4) A person shall vacate the office of Speaker or Deputy Speaker -"
    },
    {
      "paragraph": 5,
      "text": "(a) in the case of a Speaker elected from among the members of the House of Representatives or in the case of the Deputy Speaker -"
    },
    {
      "paragraph": 6,
      "text": "(i) if he ceases to be a member of the House:"
    },
    {
      "paragraph": 7,
      "text": "Provided that the Speaker shall not vacate his office by reason only that he has ceased to be a member of the House on a dissolution of Parliament, until the House first meets after that dissolution; or"
    },
    {
      "paragraph": 8,
      "text": "(ii) if he becomes a Minister or a Parliamentary Secretary;"
    },
    {
      "paragraph": 9,
      "text": "(b) in the case of a Speaker elected from among persons who are not members of the House of Representatives -"
    },
    {
      "paragraph": 10,
      "text": "(i) when the House first meets after any dissolution of Parliament; or"
    },
    {
      "paragraph": 11,
      "text": "(ii) if any circumstances arise that would cause him to be disqualified for election as a member of the House of Representatives;"
    },
    {
      "paragraph": 12,
      "text": "(c) if he resigns his office by writing under his hand addressed, in the case of the Speaker, to the Clerk of the House of Representatives and, in the case of the Deputy Speaker, to the Speaker or, if the office of Speaker is vacant or the Speaker is absent from Malta, to the Clerk of the House of Representatives;"
    },
    {
      "paragraph": 13,
      "text": "(d) in the case of the Deputy Speaker, if he is elected to be Speaker."
    },
    {
      "paragraph": 14,
      "text": "(5) (a) If, by virtue of sub-article (2) of article 55 of this Constitution, the Speaker is required to cease to perform his functions as a member of the House of Representatives he shall also cease to perform his functions as Speaker; and those functions shall, until he vacates his seat in the House or resumes the performance of the functions of his office, be performed -"
    },
    {
      "paragraph": 15,
      "text": "(i) by the Deputy Speaker; or"
    },
    {
      "paragraph": 16,
      "text": "(ii) if the office of Deputy Speaker is vacant or the Deputy Speaker is required to cease to perform his functions as a member of the House of Representatives by virtue of sub-article (2) of article 55 of this Constitution, by such member of the House (not being a Minister or a Parliamentary Secretary) as the House may elect for the purpose."
    },
    {
      "paragraph": 17,
      "text": "(b) If the Speaker or Deputy Speaker resumes the performance of his functions as a member of the House, in accordance with the provisions of sub-article (2) of article 55 of this Constitution, he shall also resume the performance of his functions as Speaker or Deputy Speaker, as the case may be."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [
    {
      "article": 55,
      "description": "Reference to determination of questions as to membership of House of Representatives"
    }
  ],
  "notes": "This article establishes the procedures for electing and replacing the Speaker and Deputy Speaker of the House of Representatives, and specifies the circumstances under which they must vacate their offices."
} 