{
  "number": 56,
  "title": "Voting at elections",
  "chapterNumber": 6,
  "chapterTitle": "Parliament",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Subject to the provisions of this article, the vote of electors at any election of members of the House of Representatives shall be given by ballot in such manner as may be prescribed by or under any law for the time being in force in Malta."
    },
    {
      "paragraph": 2,
      "text": "(2) (a) If a voter of an electoral division informs the Electoral Commission in the period between the publication of the election candidates and the day before the polls are open, that, due to illness or being abroad, such voter will not be in Malta during the day set for voting, or that such voter will be hospitalized during such period, and can provide relevant evidence to the satisfaction of the Electoral Commission, such voter may be permitted to cast his vote at a day set for voting which is earlier than the general election date, on condition that the counting of all votes cast for the general election will not be possible before the close of polling on the day set for polling."
    },
    {
      "paragraph": 3,
      "text": "(b) If it is proven to the satisfaction of the Electoral Commission that a voter is unable to cast his vote at the poll booth on the day fixed for such purpose due to illness, or physical or mental infirmity, duly certified under such conditions as may be prescribed by law, such voter may be permitted by the Commission to cast his vote on any one of the days preceding the day fixed for the general election in accordance with the provisions of paragraph (a)."
    },
    {
      "paragraph": 4,
      "text": "(c) Notwithstanding the provisions of sub-article (1) and without prejudice to the provisions of paragraphs (a) and (b), and subject to such safeguards for ensuring the secrecy of the vote as may be prescribed by Parliament, Parliament may make provision for enabling any registered voter who is prevented from voting at the place at which he is entitled to cast his vote, to vote in any place in Malta of his choice, under the same conditions which apply to other voters at the place at which he is entitled to vote."
    },
    {
      "paragraph": 5,
      "text": "(d) Notwithstanding the provisions of sub-article (1) and without prejudice to the provisions of paragraphs (a), (b) and (c), Parliament may make provision for enabling persons to whom sub-article (7) applies to vote by post, or in such manner as Parliament may provide, subject to such safeguards as may be necessary to ensure that such persons may vote freely and without intimidation."
    },
    {
      "paragraph": 6,
      "text": "(3) Voting at any election for members of the House of Representatives shall be held at such time or times and at such place or places as the Electoral Commission may, from time to time, determine."
    },
    {
      "paragraph": 7,
      "text": "(4) For the purposes of paragraph (d) of sub-article (2), the persons to whom sub-article (7) applies are -"
    },
    {
      "paragraph": 8,
      "text": "(a) persons who are unable to vote at any place at which they may be entitled to vote under any law for the time being in force in Malta, because they will be, on the date or dates determined for voting pursuant to sub-article (3), outside Malta; or"
    },
    {
      "paragraph": 9,
      "text": "(b) persons who are unable to vote at any such place because they are or will be, on such date or dates, in Malta but hospitalized or in such institutions for the care of the elderly or otherwise prevented from voting at such place due to illness, infirmity or physical disability; or"
    },
    {
      "paragraph": 10,
      "text": "(c) persons who are unable to vote at any such place because of duties being carried out outside Malta in connection with the representation of the Government of Malta, or with any international or multinational organization of which Malta or the Government of Malta form part, or being employed by the Government of Malta as public officers or locally engaged staff in the diplomatic, consular or other representation of the Government of Malta, or being married to or being the son or daughter of such persons, if of eighteen years of age or over and ordinarily resident with them; or"
    },
    {
      "paragraph": 11,
      "text": "(d) persons who are ordinarily resident in Malta but who are or will be outside Malta on the date or dates determined for voting for reasons of study, work, health or vacation."
    }
  ],
  "amendmentHistory": {
    "date": "2018-07-20",
    "description": "Amendment regarding voting outside Malta and for persons with disabilities",
    "legalReference": "Act XXVI of 2018"
  },
  "crossReferences": [],
  "notes": "This article establishes provisions for voting in elections for the House of Representatives, including standard ballot voting, early voting for those ill or abroad, alternative voting locations, and provisions for postal voting for certain categories of voters."
} 