{
  "number": 110,
  "title": "Appointment of public officers",
  "chapterNumber": 10,
  "chapterTitle": "The Public Service",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Subject to the provisions of this Constitution, power to make appointments to public offices and to remove and to exercise disciplinary control over persons holding or acting in any such offices shall vest in the Prime Minister, acting on the recommendation of the Public Service Commission:"
    },
    {
      "paragraph": 2,
      "text": "Provided that the Prime Minister may, acting on the recommendation of the Public Service Commission, by direction in writing, delegate, subject to such conditions as may be specified in the direction, any of the powers vested in him by this sub-article to such public officer or other authority as may be so specified."
    },
    {
      "paragraph": 3,
      "text": "(2) The power to make appointments to the office of head of department shall vest in the Prime Minister acting after consultation with the Public Service Commission:"
    },
    {
      "paragraph": 4,
      "text": "Provided that before exercising the power conferred by this sub-article in relation to the Clerk to the House of Representatives, the Prime Minister shall consult with the Speaker."
    },
    {
      "paragraph": 5,
      "text": "(3) Notwithstanding the provisions of sub-article (1) of this article, appointments to the offices specified in article 91, article 92 (other than sub-article (4) thereof), article 94, article 96, article 98, article 101A and article 108 shall be made by the President in accordance with the provisions of those articles."
    },
    {
      "paragraph": 6,
      "text": "(4) Notwithstanding the provisions of sub-article (1) of this article, appointments to the office of Permanent Secretary shall be made in accordance with the provisions of article 92(4)."
    },
    {
      "paragraph": 7,
      "text": "(5) The Public Service Commission shall not be consulted on any matter falling to be considered by the Commission for Administrators of Justice, or any matter relating to any person holding or acting in any office the power to make appointments to which vests in the President acting in accordance with the advice of a commission established by this Constitution."
    },
    {
      "paragraph": 8,
      "text": "(6) Before the Public Service Commission gives its advice on any matter referred to it by the Prime Minister in pursuance of sub-article (1) of this article, it shall consult with the Minister concerned."
    },
    {
      "paragraph": 9,
      "text": "(7) A law may make provision for determining the procedure of the Public Service Commission, including any procedure as may be required for the presentation of any recommendations made by the Commission, and for prescribing any matter authorised by this Constitution to be prescribed."
    },
    {
      "paragraph": 10,
      "text": "(8) Any person aggrieved by any decision of the Prime Minister, acting on the recommendation of the Public Service Commission, in relation to employment within the public service may appeal to the Public Service Appeals Board."
    },
    {
      "paragraph": 11,
      "text": "(9) No appeal shall lie from any decision of the Public Service Appeals Board."
    }
  ],
  "amendmentHistory": {
    "date": "2020-07-29",
    "description": "Amendment regarding appointments to public offices and appeals to the Public Service Appeals Board",
    "legalReference": "Act XLIII of 2020"
  },
  "crossReferences": [
    {
      "article": "91",
      "description": "Attorney General"
    },
    {
      "article": "92",
      "description": "Permanent Secretaries and heads of departments"
    },
    {
      "article": "94",
      "description": "Commissioner of Police"
    },
    {
      "article": "96",
      "description": "Appointment of judges"
    },
    {
      "article": "98",
      "description": "Acting Chief Justice and Acting judges"
    },
    {
      "article": "101A",
      "description": "Commission for the Administration of Justice"
    },
    {
      "article": "108",
      "description": "Auditor General"
    }
  ],
  "notes": "This article establishes the procedures for appointing public officers, with authority vested in the Prime Minister acting on recommendations of the Public Service Commission, subject to various exceptions and provisions for specific offices. It also provides for appeals against decisions to the Public Service Appeals Board."
} 