{
  "number": 113,
  "title": "Protection of pension rights",
  "chapterNumber": 10,
  "chapterTitle": "The Public Service",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) The law applicable to any benefits to which this article applies shall, in relation to any person who has been granted or who is eligible for the grant of such benefits, be that in force on the relevant date or any later law that is not less favourable to that person."
    },
    {
      "paragraph": 2,
      "text": "(2) In this article \"the relevant date\" means -"
    },
    {
      "paragraph": 3,
      "text": "(a) in relation to any benefits granted before the appointed day, the date on which those benefits were granted;"
    },
    {
      "paragraph": 4,
      "text": "(b) in relation to any benefits granted on or after the appointed day to or in respect of a person who was a public officer before that day, the day immediately preceding the appointed day; and"
    },
    {
      "paragraph": 5,
      "text": "(c) in relation to any benefits granted to or in respect of a person who first becomes a public officer on or after the appointed day, the date on which he becomes a public officer."
    },
    {
      "paragraph": 6,
      "text": "(3) Where a person is entitled to exercise an option as to which of two or more laws shall apply in his case, the law specified by him in exercising the option shall, for the purposes of this article, be deemed to be more favourable to him than the other law or laws."
    },
    {
      "paragraph": 7,
      "text": "(4) Any benefit to which this article applies (not being a benefit that is a charge on some other public fund of Malta) shall be a charge on the Consolidated Fund."
    },
    {
      "paragraph": 8,
      "text": "(5) A reference to the law applicable to any benefits to which this article applies includes (without prejudice to the generality of the expression) a reference to any law relating to the time at which and the manner in which any person may retire in order to become eligible for those benefits."
    },
    {
      "paragraph": 9,
      "text": "(6) This article applies to any benefits payable under any law providing for the grant of pensions, gratuities or other like benefits to public officers on their retirement, to the widows, children, dependants or personal representatives of public officers in respect of their service as public officers or to the widows, children, dependants or personal representatives of persons who, having been public officers, have died."
    },
    {
      "paragraph": 10,
      "text": "(7) References in this article to the law applicable to any benefits include (without prejudice to their generality) references to any law relating to the time at which and the manner in which a person may retire in order to become eligible for those benefits."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [],
  "notes": "This article guarantees that pension benefits and similar benefits for public officers cannot be reduced by subsequent laws, ensuring that public officers receive benefits according to the most favorable terms. It also specifies that these benefits are charged to the Consolidated Fund, unless charged to another public fund."
} 