{
  "number": 109,
  "title": "Public Service Commission",
  "chapterNumber": 10,
  "chapterTitle": "The Public Service",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be a Public Service Commission for Malta which shall consist of a chairman and such number of other members not being less than two and not being more than four as may be determined by the President, acting in accordance with the advice of the Prime Minister given after he has consulted with the Leader of the Opposition."
    },
    {
      "paragraph": 2,
      "text": "(2) The members of the Public Service Commission shall be appointed by the President, acting in accordance with the advice of the Prime Minister given after he has consulted the Leader of the Opposition."
    },
    {
      "paragraph": 3,
      "text": "(3) A person shall not be qualified to hold office as a member of the Public Service Commission if he is a Minister, a Parliamentary Secretary, a member of, or a candidate for election to, the House of Representatives, a member of a local government authority or if he is a public officer."
    },
    {
      "paragraph": 4,
      "text": "(4) A member of the Public Service Commission shall not, within a period of three years commencing with the day on which he last held office as a member, be eligible for appointment to or to act in any public office."
    },
    {
      "paragraph": 5,
      "text": "(5) Subject to the provisions of this article, the office of a member of the Public Service Commission shall become vacant -"
    },
    {
      "paragraph": 6,
      "text": "(a) at the expiration of five years from the date of his appointment or at such earlier time as may be specified in the instrument by which he was appointed; or"
    },
    {
      "paragraph": 7,
      "text": "(b) if any circumstances arise that, if he were not a member of the Commission, would cause him to be disqualified for appointment as such."
    },
    {
      "paragraph": 8,
      "text": "(6) A member of the Public Service Commission may be removed from office by the President, acting in accordance with the advice of the Prime Minister, but he may be removed only for inability to discharge the functions of his office (whether arising from infirmity of body or mind or any other cause) or for misbehaviour."
    },
    {
      "paragraph": 9,
      "text": "(7) If the office of a member of the Public Service Commission is vacant or if a member is for any reason unable to perform the functions of his office, the President, acting in accordance with the advice of the Prime Minister, given after he has consulted the Leader of the Opposition, may appoint a person who is qualified to be appointed to be a member to be a temporary member of the Commission; and any person so appointed shall, subject to the provisions of sub-articles (5) and (6) of this article, cease to be such a member when a person has been appointed to fill the vacancy or, as the case may be, when the member who was unable to perform the functions of his office resumes those functions."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [],
  "notes": "This article establishes the Public Service Commission, its composition, qualifications for membership, duration of appointment, and circumstances for vacancy or removal. It also provides for the appointment of temporary members when necessary."
} 