{
  "number": 105,
  "title": "Appropriation of funds",
  "chapterNumber": 9,
  "chapterTitle": "Finance",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) The Minister responsible for finance shall cause to be prepared and laid before the House of Representatives before, or not later than thirty days after, the commencement of each financial year estimates of the revenues and expenditure of Malta for that year."
    },
    {
      "paragraph": 2,
      "text": "(2) The heads of expenditure contained in the estimates for a financial year (other than expenditure charged upon the Consolidated Fund by this Constitution or by any other law for the time being in force in Malta) shall be included in a bill, to be known as an appropriation bill, providing for the issue from the Consolidated Fund of the sums necessary to meet that expenditure and the appropriation of those sums for the purposes specified therein."
    },
    {
      "paragraph": 3,
      "text": "(3) If in respect of any financial year it is found -"
    },
    {
      "paragraph": 4,
      "text": "(a) that the amount appropriated by the Appropriation Act for any purpose is insufficient, or that a need has arisen for expenditure for a purpose for which no amount has been appropriated by that Act; or"
    },
    {
      "paragraph": 5,
      "text": "(b) that any moneys have been expended for any purpose in excess of the amount appropriated for the purpose by the Appropriation Act or for a purpose for which no amount has been appropriated by that Act,"
    },
    {
      "paragraph": 6,
      "text": "a supplementary estimate showing the sums required or spent shall be laid before the House of Representatives and the heads of any such expenditure shall be included in a supplementary appropriation bill."
    },
    {
      "paragraph": 7,
      "text": "(4) The Minister responsible for finance may, without obtaining the previous approval of the House of Representatives, authorize the withdrawal of moneys from the Consolidated Fund for the purpose of meeting expenditure which is charged by the Constitution or by any other law upon the Consolidated Fund."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [],
  "notes": "This article outlines the process for appropriating funds from the Consolidated Fund, requiring the Minister of Finance to prepare annual budget estimates, the passage of an appropriation bill for expenditure not already charged on the Fund, and provisions for supplementary estimates and expenditure. It also allows the Minister to authorize withdrawals for expenditure already charged on the Fund without prior approval of the House."
} 