{
  "number": 121,
  "title": "Powers and procedures of Commissions",
  "chapterNumber": 11,
  "chapterTitle": "Miscellaneous",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Any Commission established by this Constitution may, with the consent of the Prime Minister or such other Minister as may be authorised in that behalf by the Prime Minister by regulation or otherwise regulate its own procedure and confer powers and impose duties on any public officer or authority of the Government of Malta for the purpose of discharging its functions."
    },
    {
      "paragraph": 2,
      "text": "(2) Any Commission established by this Constitution may act notwithstanding any vacancy in its membership or the absence of any member and any proceedings thereof shall be valid notwithstanding that some person who was not entitled so to do took part therein."
    },
    {
      "paragraph": 3,
      "text": "(3) Any question proposed for decision at any meeting of any Commission established by this Constitution shall be determined by a majority of the votes of all the members thereof, and if on any such question the votes are equally divided the member presiding shall have and exercise a casting vote."
    },
    {
      "paragraph": 4,
      "text": "(4) For the purposes of sub-article (3) of this article, the references to a member of the Electoral Commission shall be construed as including a reference to the Chairman of that Commission."
    },
    {
      "paragraph": 5,
      "text": "(5) The provisions of this article shall apply to the Broadcasting Authority established by this Constitution."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [
    {
      "article": "61",
      "description": "Electoral Commission"
    },
    {
      "article": "118",
      "description": "Broadcasting Authority"
    }
  ],
  "notes": "This article establishes general provisions for the powers and procedures of Commissions established by the Constitution, including their ability to regulate their own procedure, act despite vacancies, and make decisions by majority vote with the presiding member having a casting vote in case of a tie."
} 