{
  "number": 118,
  "title": "Broadcasting Authority",
  "chapterNumber": 11,
  "chapterTitle": "Miscellaneous",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be a Broadcasting Authority for Malta which shall consist of a chairman and such number of other members not being less than four as may be prescribed by any law for the time being in force in Malta."
    },
    {
      "paragraph": 2,
      "text": "(2) The members of the Broadcasting Authority shall be appointed by the President, acting in accordance with the advice of the Prime Minister given after he has consulted the Leader of the Opposition."
    },
    {
      "paragraph": 3,
      "text": "(3) A person shall not be qualified to hold office as a member of the Broadcasting Authority if he is a Minister, a Parliamentary Secretary, a member of, or candidate for election to, the House of Representatives, a member of a local government authority or if he is a public officer."
    },
    {
      "paragraph": 4,
      "text": "(4) A member of the Broadcasting Authority shall not, within a period of three years commencing with the day on which he last held office or acted as a member, be eligible for appointment to or to act in any public office."
    },
    {
      "paragraph": 5,
      "text": "(5) Subject to the provisions of this article, the office of a member of the Broadcasting Authority shall become vacant -"
    },
    {
      "paragraph": 6,
      "text": "(a) at the expiration of five years from the date of his appointment or at such earlier time as may be specified in the instrument by which he was appointed; or"
    },
    {
      "paragraph": 7,
      "text": "(b) if any circumstances arise that, if he were not a member of the Authority, would cause him to be disqualified for appointment as such."
    },
    {
      "paragraph": 8,
      "text": "(6) A member of the Broadcasting Authority may be removed from office by the President, acting in accordance with the advice of the Prime Minister, but he may be removed only for inability to discharge the functions of his office (whether arising from infirmity of body or mind or any other cause) or for misbehaviour."
    },
    {
      "paragraph": 9,
      "text": "(7) The functions of the Broadcasting Authority shall be to ensure that, so far as possible, in such sound and television broadcasting services as may be provided in Malta, due impartiality is preserved in respect of matters of political or industrial controversy or relating to current public policy and that broadcasting facilities and time are fairly apportioned between persons belonging to different political parties."
    },
    {
      "paragraph": 10,
      "text": "(8) The Broadcasting Authority shall have such other functions and duties as may be assigned to it by any law for the time being in force in Malta."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [],
  "notes": "This article establishes the Broadcasting Authority, its composition, appointment process, qualifications for membership, and functions, particularly to ensure impartiality in broadcasting on political matters and fair allocation of broadcasting facilities and time between different political parties."
} 