{
  "number": 120,
  "title": "Employment Commission",
  "chapterNumber": 11,
  "chapterTitle": "Miscellaneous",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be an Employment Commission for Malta which shall consist of a chairman and four other members."
    },
    {
      "paragraph": 2,
      "text": "(2) The members of the Employment Commission shall be appointed by the President who, in appointing the chairman shall act in accordance with the advice of the Prime Minister given after he has consulted the Leader of the Opposition, in appointing two of the four other members shall act in accordance with the advice of the Prime Minister, and in appointing the other two members shall act in accordance with the advice of the Leader of the Opposition."
    },
    {
      "paragraph": 3,
      "text": "(3) A person shall not be qualified to hold office as a member of the Employment Commission if he is a Minister, a Parliamentary Secretary, a member of, or a candidate for election to, the House of Representatives, a member of a local government authority, or if he is a public officer."
    },
    {
      "paragraph": 4,
      "text": "(4) A member of the Employment Commission shall not, within a period of three years commencing with the day on which he last held office or acted as a member, be eligible for appointment to or to act in any public office."
    },
    {
      "paragraph": 5,
      "text": "(5) Subject to the provisions of this article, the office of a member of the Employment Commission shall become vacant -"
    },
    {
      "paragraph": 6,
      "text": "(a) at the expiration of three years from the date of his appointment; or"
    },
    {
      "paragraph": 7,
      "text": "(b) if any circumstances arise that, if he were not a member of the Commission, would cause him to be disqualified for appointment as such."
    },
    {
      "paragraph": 8,
      "text": "(6) A member of the Employment Commission may be removed from office by the President, acting in accordance with the advice of the holder of the office on whose advice such member was appointed, given, in the case of the chairman, after consultation with the Leader of the Opposition, but such member may be removed only for inability to discharge the functions of his office (whether arising from infirmity of body or mind or any other cause) or for misbehaviour."
    },
    {
      "paragraph": 9,
      "text": "(7) The Employment Commission shall have such functions as may be assigned to it by any law for the time being in force in Malta."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [],
  "notes": "This article establishes the Employment Commission, its composition, appointment process, qualifications for membership, and provisions for vacancy and removal from office. The specific functions of the Commission are to be assigned by law."
} 