{
  "number": 124,
  "title": "Interpretation",
  "chapterNumber": 11,
  "chapterTitle": "Miscellaneous",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) In this Constitution, unless the context otherwise requires -"
    },
    {
      "paragraph": 2,
      "text": "\"the appointed day\" means 21st September 1964;"
    },
    {
      "paragraph": 3,
      "text": "\"the House\" means the House of Representatives established by article 51 of this Constitution;"
    },
    {
      "paragraph": 4,
      "text": "\"law\" includes any instrument having the force of law and any unwritten rule of law and \"lawful\" and \"lawfully\" shall be construed accordingly;"
    },
    {
      "paragraph": 5,
      "text": "\"Malta\" means the Island of Malta, the Island of Gozo and the other islands of the Maltese Archipelago, including the territorial waters thereof;"
    },
    {
      "paragraph": 6,
      "text": "\"oath of allegiance\" means the oath of allegiance set out in the Third Schedule to this Constitution or such other oath as may be prescribed by Parliament;"
    },
    {
      "paragraph": 7,
      "text": "\"Parliament\" means the Parliament of Malta;"
    },
    {
      "paragraph": 8,
      "text": "\"public office\" means an office of emolument in the public service;"
    },
    {
      "paragraph": 9,
      "text": "\"public officer\" means the holder of any public office or a person appointed to act in any such office;"
    },
    {
      "paragraph": 10,
      "text": "\"the public service\" means, subject to the provisions of sub-articles (2) and (3) of this article, the service of the Government of Malta in a civil capacity;"
    },
    {
      "paragraph": 11,
      "text": "\"session\" means the sittings of the House of Representatives commencing when it first meets after the appointed day or after the prorogation or dissolution of Parliament at any time and terminating when Parliament is prorogued or is dissolved without having been prorogued;"
    },
    {
      "paragraph": 12,
      "text": "\"sitting\" means a period during which the House of Representatives is sitting continuously without adjournment, and includes any period during which the House is in committee."
    },
    {
      "paragraph": 13,
      "text": "(2) In this Constitution, unless the context otherwise requires, references to public offices include references to the offices of judges of the Superior Courts, references to the offices of Magistrates of the Inferior Courts, references to the office of members of the Police Force and references to the offices in the Attorney General's Office."
    },
    {
      "paragraph": 14,
      "text": "(3) In this Constitution \"the public service\" does not include service in the office of -"
    },
    {
      "paragraph": 15,
      "text": "(a) President, Speaker, Deputy Speaker, Minister, Parliamentary Secretary, Leader of the Opposition, Ambassador, High Commissioner or such other analogous office as the President may, acting in accordance with the advice of the Prime Minister, prescribe;"
    },
    {
      "paragraph": 16,
      "text": "(b) member of the House of Representatives, a member of any Commission established by this Constitution, or a member of the Malta Broadcasting Authority;"
    },
    {
      "paragraph": 17,
      "text": "(c) save where the holder of the office is selected from the public service, the Auditor General and the Deputy Auditor General, the Attorney General, the Commissioner of Police, and the Principal Permanent Secretary;"
    },
    {
      "paragraph": 18,
      "text": "(d) any office the appointment to or the tenure of which is, pursuant to any provision of this Constitution, made or approved by the President, the House of Representatives, a Commission established by this Constitution, or any Committee of the House of Representatives."
    },
    {
      "paragraph": 19,
      "text": "(4) For the purposes of this Constitution, a person shall not be regarded as holding a public office by reason only of the fact that he is in receipt of a pension or other like allowance in respect of public service."
    },
    {
      "paragraph": 20,
      "text": "(5) In this Constitution, unless the context otherwise requires, a reference to the holder of an office by the term designating his office shall be construed as including a reference to any person who is for the time being lawfully acting in or performing the functions of that office."
    },
    {
      "paragraph": 21,
      "text": "(6) Where power is vested by this Constitution in any person or authority to appoint a person to act in or perform the functions of any office if the holder thereof is himself unable to perform those functions, no such appointment shall be called in question on the ground that the holder was able to perform those functions."
    }
  ],
  "amendmentHistory": {
    "date": "2020-07-29",
    "description": "Amendment regarding the definition of public service and public offices",
    "legalReference": "Act XLIII of 2020"
  },
  "crossReferences": [
    {
      "article": "51",
      "description": "Establishment of Parliament"
    }
  ],
  "notes": "This article provides definitions and interpretations of various terms used throughout the Constitution, including 'appointed day', 'law', 'Malta', 'Parliament', 'public office', and 'public service', among others. It also clarifies what positions are included in or excluded from the public service."
} 