{
  "number": 41,
  "title": "Protection of freedom of expression",
  "chapterNumber": 4,
  "chapterTitle": "Fundamental Rights and Freedoms of the Individual",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Except with his own consent or by way of parental discipline, no person shall be hindered in the enjoyment of his freedom of expression, including freedom to hold opinions without interference, freedom to receive ideas and information without interference, freedom to communicate ideas and information without interference (whether the communication be to the public generally or to any person or class of persons) and freedom from interference with his correspondence."
    },
    {
      "paragraph": 2,
      "text": "(2) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of sub-article (1) of this article to the extent that the law in question makes provision -"
    },
    {
      "paragraph": 3,
      "text": "(a) that is reasonably required -"
    },
    {
      "paragraph": 4,
      "text": "(i) in the interests of defence, public safety, public order, public morality or decency, or public health; or"
    },
    {
      "paragraph": 5,
      "text": "(ii) for the purpose of protecting the reputations, rights and freedoms of other persons, or the private lives of persons concerned in legal proceedings, preventing the disclosure of information received in confidence, maintaining the authority and independence of the courts, protecting the privileges of Parliament, or regulating telephony, telegraphy, posts, wireless broadcasting, television or other means of communication, public exhibitions or public entertainments; or"
    },
    {
      "paragraph": 6,
      "text": "(b) that imposes restrictions upon public officers,"
    },
    {
      "paragraph": 7,
      "text": "and except so far as that provision or, as the case may be, the thing done under the authority thereof is shown not to be reasonably justifiable in a democratic society."
    },
    {
      "paragraph": 8,
      "text": "(3) Anyone who is resident in Malta may edit or print a newspaper or journal published daily or periodically:"
    },
    {
      "paragraph": 9,
      "text": "Provided that provision may be made by law -"
    },
    {
      "paragraph": 10,
      "text": "(a) prohibiting or restricting the editing or printing of any such newspaper or journal by persons under twenty-one years of age; and"
    },
    {
      "paragraph": 11,
      "text": "(b) requiring any person who is the editor or printer of any such newspaper or journal to inform the prescribed authority to that effect and of his age and to keep the prescribed authority informed of his place of residence."
    },
    {
      "paragraph": 12,
      "text": "(4) Where the police seize any edition of a newspaper as being the means whereby a criminal offence has been committed they shall within twenty-four hours of the seizure bring the matter before a competent court and if the court is not satisfied that there is a prima facie case of such offence, that edition shall be returned to the person from whom it was seized."
    },
    {
      "paragraph": 13,
      "text": "(5) No person shall be deprived of his citizenship under any provisions made under article 30(1)(b) of this Constitution or of his juridical capacity by reason only of his political opinions."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [
    {
      "article": 30,
      "description": "Reference to citizenship provisions"
    }
  ],
  "notes": "This article guarantees freedom of expression, including freedom to hold opinions, receive and communicate information, and freedom from interference with correspondence, with certain limitations."
} 