{
  "number": 42,
  "title": "Protection of freedom of assembly and association",
  "chapterNumber": 4,
  "chapterTitle": "Fundamental Rights and Freedoms of the Individual",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Except with his own consent or by way of parental discipline no person shall be hindered in the enjoyment of his freedom of peaceful assembly and association, that is to say, his right peacefully to assemble freely and associate with other persons and in particular to form or belong to trade unions or other associations for the protection of his interests."
    },
    {
      "paragraph": 2,
      "text": "(2) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of this article to the extent that the law in question makes provision -"
    },
    {
      "paragraph": 3,
      "text": "(a) that is reasonably required -"
    },
    {
      "paragraph": 4,
      "text": "(i) in the interests of defence, public safety, public order, public morality or decency, or public health; or"
    },
    {
      "paragraph": 5,
      "text": "(ii) for the purpose of protecting the rights or freedoms of other persons; or"
    },
    {
      "paragraph": 6,
      "text": "(b) that imposes restrictions upon public officers,"
    },
    {
      "paragraph": 7,
      "text": "and except so far as that provision or, as the case may be, the thing done under the authority thereof is shown not to be reasonably justifiable in a democratic society."
    },
    {
      "paragraph": 8,
      "text": "(3) For the purposes of this article, any provision in any law prohibiting the holding of public meetings or demonstrations in any one or more particular cities, towns, suburbs or villages shall be held to be a provision which is not reasonably justifiable in a democratic society."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [],
  "notes": "This article guarantees freedom of peaceful assembly and association, including the right to form or join trade unions, with certain limitations in the interests of public safety and order."
} 