{
  "number": 47,
  "title": "Interpretation of Chapter IV",
  "chapterNumber": 4,
  "chapterTitle": "Fundamental Rights and Freedoms of the Individual",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) In this Chapter, save where the context otherwise requires, the following expressions have the following meanings respectively, that is to say -"
    },
    {
      "paragraph": 2,
      "text": "\"contravention\", in relation to any requirement, includes a failure to comply with that requirement, and cognate expressions shall be construed accordingly;"
    },
    {
      "paragraph": 3,
      "text": "\"court\" means any court of law in Malta other than a court constituted by or under a disciplinary law and, in articles 33 and 35 of this Constitution, includes a court constituted by or under a disciplinary law;"
    },
    {
      "paragraph": 4,
      "text": "\"disciplinary law\" means a law regulating the discipline -"
    },
    {
      "paragraph": 5,
      "text": "(a) of any disciplined force; or"
    },
    {
      "paragraph": 6,
      "text": "(b) of persons serving prison sentences;"
    },
    {
      "paragraph": 7,
      "text": "\"disciplined force\" means -"
    },
    {
      "paragraph": 8,
      "text": "(a) a naval, military or air force;"
    },
    {
      "paragraph": 9,
      "text": "(b) the Malta Police Force;"
    },
    {
      "paragraph": 10,
      "text": "(c) any other police force established by law in Malta;"
    },
    {
      "paragraph": 11,
      "text": "(d) the prison service;"
    },
    {
      "paragraph": 12,
      "text": "\"member\", in relation to a disciplined force, includes any person who, under the law regulating the discipline of that force, is subject to that discipline."
    },
    {
      "paragraph": 13,
      "text": "(2) In this Chapter \"period of public emergency\" means any period during which -"
    },
    {
      "paragraph": 14,
      "text": "(a) Malta is engaged in any war; or"
    },
    {
      "paragraph": 15,
      "text": "(b) there is in force a proclamation by the President declaring that a state of public emergency exists; or"
    },
    {
      "paragraph": 16,
      "text": "(c) there is in force a resolution of the House of Representatives supported by the votes of not less than two-thirds of all the members of the House declaring that democratic institutions in Malta are threatened by subversion."
    },
    {
      "paragraph": 17,
      "text": "(3) (a) Where any proclamation of emergency has been made, copies thereof shall as soon as practicable be laid before the House of Representatives, and if the House is not then sitting it shall be summoned to meet as soon as practicable."
    },
    {
      "paragraph": 18,
      "text": "(b) A proclamation of emergency shall, unless it is sooner revoked by the President, cease to be in force at the expiration of a period of fourteen days beginning on the date on which it was made unless it has before the expiration of that period been approved by a resolution of the House of Representatives:"
    },
    {
      "paragraph": 19,
      "text": "Provided that if any such proclamation is issued at a time when Parliament is dissolved or when the House of Representatives is dissolved or the dissolution of the House of Representatives has occurred but the general election has not yet been held, such proclamation shall cease to be in force at the expiration of a period of fourteen days beginning on the date on which the House of Representatives first meets after that general election unless it has before the expiration of that period been approved by a resolution of the House."
    },
    {
      "paragraph": 20,
      "text": "(c) A proclamation of emergency may be revoked by the President."
    },
    {
      "paragraph": 21,
      "text": "(d) A proclamation of emergency that has been approved by a resolution of the House of Representatives shall, subject to the provisions of paragraph (c) of this sub-article, remain in force so long as the resolution remains in force and no longer."
    },
    {
      "paragraph": 22,
      "text": "(e) A resolution of the House of Representatives passed for the purposes of this sub-article shall remain in force for a period of three months or for such shorter period as may be specified therein:"
    },
    {
      "paragraph": 23,
      "text": "Provided that any such resolution may be extended from time to time by a further resolution of the House of Representatives, each extension not exceeding three months from the date of the resolution effecting the extension."
    },
    {
      "paragraph": 24,
      "text": "(f) A resolution of the House of Representatives for the purposes of paragraph (c) of sub-article (2) of this article may be revoked by a resolution of the House."
    },
    {
      "paragraph": 25,
      "text": "(4) In relation to any person who is a member of a disciplined force raised under any law in force in Malta, nothing contained in or done under the authority of the disciplinary law of that force shall be held to be inconsistent with or in contravention of any of the provisions of this Chapter other than articles 33, 35 and 36."
    },
    {
      "paragraph": 26,
      "text": "(5) In relation to any person who is a member of a disciplined force raised otherwise than as aforesaid and lawfully present in Malta, nothing contained in or done under the authority of the disciplinary law of that force shall be held to be inconsistent with or in contravention of any of the provisions of this Chapter."
    },
    {
      "paragraph": 27,
      "text": "(6) Until the expiration of a period ending on the 30th June, 1993, nothing contained in any such law as is referred to in article 38 of this Constitution and nothing done by virtue of any such law shall be held to be inconsistent with the provisions of articles 33 to 45 (inclusive) of this Chapter."
    },
    {
      "paragraph": 28,
      "text": "(7) Where any person is detained by virtue of any such law as is referred to in article 38 of this Constitution by virtue of such law does any act whereby any such right of any person as is mentioned in sub-article (6) of this article is infringed or any such freedom of any person as is so mentioned is violated, the following provisions of this article shall apply, that is to say:-"
    },
    {
      "paragraph": 29,
      "text": "(a) the detained person shall, as soon as reasonably practicable and in any case not more than five days after the commencement of his detention, be furnished with a statement in writing in a language that he understands specifying in detail the grounds upon which he is detained;"
    },
    {
      "paragraph": 30,
      "text": "(b) not more than fourteen days after the commencement of his detention, a notification shall be published in the Gazette stating that he has been detained and giving particulars of the provision of law under which his detention is authorised;"
    },
    {
      "paragraph": 31,
      "text": "(c) not more than one month after the commencement of his detention and thereafter during the detention at intervals of not more than three months, his case shall be reviewed by an independent and impartial tribunal established by law and presided over by a person appointed by the President from among persons entitled to practise in Malta as advocates or as magistrates;"
    },
    {
      "paragraph": 32,
      "text": "(d) he shall be afforded reasonable facilities to consult and instruct without delay a legal adviser of his own choice who shall be permitted to make representations to the tribunal appointed for the review of his case;"
    },
    {
      "paragraph": 33,
      "text": "(e) at the hearing of his case by the tribunal he shall be permitted to appear in person or by a legal adviser of his own choice."
    },
    {
      "paragraph": 34,
      "text": "(8) On any review by a tribunal in pursuance of this article of the case of a detained person, the tribunal may make recommendations concerning the necessity or expediency of continuing his detention to the authority by which it was ordered but, unless it is otherwise provided by law, that authority shall not be obliged to act in accordance with any such recommendations."
    },
    {
      "paragraph": 35,
      "text": "(9) Nothing contained in article 43 shall be construed as debarring the enactment in Malta of laws prescribing the grounds on which the freedom of movement of any person may be restricted to any particular part of Malta."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [
    {
      "article": 33,
      "description": "Reference to protection of right to life"
    },
    {
      "article": 35,
      "description": "Reference to protection from forced labour"
    },
    {
      "article": 36,
      "description": "Reference to protection from inhuman treatment"
    },
    {
      "article": 38,
      "description": "Reference to protection for privacy of home or other property"
    },
    {
      "article": 43,
      "description": "Reference to prohibition of deportation"
    }
  ],
  "notes": "This article provides definitions and interpretations of terms used in Chapter 4, establishes procedures for declaring a state of public emergency, and specifies how the rights and freedoms in the chapter apply to members of disciplined forces and persons detained under emergency laws."
} 