{
  "number": 45,
  "title": "Protection from discrimination on the grounds of race, etc.",
  "chapterNumber": 4,
  "chapterTitle": "Fundamental Rights and Freedoms of the Individual",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Subject to the provisions of sub-articles (4), (5) and (7) of this article, no law shall make any provision that is discriminatory either of itself or in its effect."
    },
    {
      "paragraph": 2,
      "text": "(2) Subject to the provisions of sub-articles (6), (7) and (8) of this article, no person shall be treated in a discriminatory manner by any person acting by virtue of any written law or in the performance of the functions of any public office or any public authority."
    },
    {
      "paragraph": 3,
      "text": "(3) In this article, the expression \"discriminatory\" means affording different treatment to different persons attributable wholly or mainly to their respective descriptions by race, place of origin, political opinions, colour, creed, sex, sexual orientation or gender identity whereby persons of one such description are subjected to disabilities or restrictions to which persons of another such description are not made subject or are accorded privileges or advantages which are not accorded to persons of another such description."
    },
    {
      "paragraph": 4,
      "text": "(4) Sub-article (1) of this article shall not apply to any law so far as that law makes provision -"
    },
    {
      "paragraph": 5,
      "text": "(a) for the appropriation of public revenues or other public funds; or"
    },
    {
      "paragraph": 6,
      "text": "(b) with respect to persons who are not citizens of Malta; or"
    },
    {
      "paragraph": 7,
      "text": "(c) with respect to adoption, marriage, dissolution of marriage, burial, devolution of property on death or any matters of personal law not hereinbefore specified; or"
    },
    {
      "paragraph": 8,
      "text": "(d) whereby persons of any such description as is mentioned in sub-article (3) of this article may be subjected to any disability or restriction or may be accorded any privilege or advantage which, having regard to its nature and to special circumstances pertaining to those persons or to persons of any other such description and to any other provision of this Constitution, is reasonably justifiable in a democratic society; or"
    },
    {
      "paragraph": 9,
      "text": "(e) for authorising the taking during a period of public emergency of measures that are reasonably justifiable for the purpose of dealing with the situation that exists during that period of public emergency:"
    },
    {
      "paragraph": 10,
      "text": "Provided that paragraph (c) of this sub-article shall not apply in relation to any law which makes any provision that is discriminatory, either of itself or in its effect by affording different treatment to different persons attributable wholly or mainly to their respective description by sex."
    },
    {
      "paragraph": 11,
      "text": "(5) Nothing contained in any law shall be held to be inconsistent with or in contravention of sub-article (1) of this article to the extent that it makes provision:"
    },
    {
      "paragraph": 12,
      "text": "(a) with respect to qualifications for service or conditions of service in any disciplined force; or"
    },
    {
      "paragraph": 13,
      "text": "(b) with respect to qualifications (not being qualifications specifically relating to sex) for service as a public officer or for service of a local government authority or a body corporate established for public purposes by any law."
    },
    {
      "paragraph": 14,
      "text": "(6) Sub-article (2) of this article shall not apply to anything which is expressly or by necessary implication authorised to be done by any such provision of law as is referred to in sub-article (4) or (5) of this article."
    },
    {
      "paragraph": 15,
      "text": "(7) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of this article to the extent that the law in question makes provision whereby persons of any such description as is mentioned in sub-article (3) of this article may be subjected to any restriction on the rights and freedoms guaranteed by articles 38, 40, 41, 42 and 44 of this Constitution, being such a restriction as is authorised by article 38(2), 40(2), 41(2), 42(2) or 44(3)."
    },
    {
      "paragraph": 16,
      "text": "(8) Nothing in sub-article (2) of this article shall affect any discretion relating to the institution, conduct or discontinuance of civil or criminal proceedings in any court that is vested in any person by or under this Constitution or any other law."
    },
    {
      "paragraph": 17,
      "text": "(9) A requirement, however made, that the Roman Catholic Apostolic Religion shall be taught by a person professing that religion shall not be held to be inconsistent with or in contravention of this article."
    },
    {
      "paragraph": 18,
      "text": "(10) Until the expiration of a period of two years commencing on the 1st July, 1991, nothing contained in any law made before the 1st July, 1991, shall be held to be inconsistent with the provisions of this article, in so far as that law provides for different treatment to different persons attributable wholly or mainly to their respective description by sex."
    },
    {
      "paragraph": 19,
      "text": "(11) Nothing in the provisions of this article shall apply to any law or anything done under the authority of a law, or to any procedure or arrangement, in so far as such law, thing done, procedure or arrangement provides for the taking of special measures aimed at accelerating de facto equality between men and women, and in so far only as such measures, taking into account the social fabric of Malta, are shown to be reasonably justifiable in a democratic society."
    }
  ],
  "amendmentHistory": [
    {
      "date": "1991-07-01",
      "description": "Amendment regarding sex discrimination",
      "legalReference": "Act XIX of 1991"
    },
    {
      "date": "2014-04-14",
      "description": "Amendment adding sexual orientation and gender identity as protected characteristics",
      "legalReference": "Act X of 2014"
    }
  ],
  "crossReferences": [
    {
      "article": 38,
      "description": "Reference to protection for privacy of home or other property"
    },
    {
      "article": 40,
      "description": "Reference to protection of freedom of conscience and worship"
    },
    {
      "article": 41,
      "description": "Reference to protection of freedom of expression"
    },
    {
      "article": 42,
      "description": "Reference to protection of freedom of assembly and association"
    },
    {
      "article": 44,
      "description": "Reference to protection of freedom of movement"
    }
  ],
  "notes": "This article prohibits discrimination on the grounds of race, place of origin, political opinions, color, creed, sex, sexual orientation, or gender identity, with certain exceptions and qualifications."
} 