{
  "number": 40,
  "title": "Protection of freedom of conscience and worship",
  "chapterNumber": 4,
  "chapterTitle": "Fundamental Rights and Freedoms of the Individual",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) All persons in Malta shall have full freedom of conscience and enjoy the free exercise of their respective mode of religious worship."
    },
    {
      "paragraph": 2,
      "text": "(2) No person shall be required to receive instruction in religion or to show knowledge or proficiency in religion if, in the case of a person who has not attained the age of sixteen years, objection to such requirement is made by the person who according to law has authority over him and, in any other case, if the person so required objects thereto:"
    },
    {
      "paragraph": 3,
      "text": "Provided that no such requirement shall be held to be inconsistent with or in contravention of this article to the extent that the knowledge of, or the proficiency or instruction in, religion is required for the teaching of such religion, or for admission to the priesthood or to a religious order, or for other religious purposes, and except so far as that requirement is shown not to be reasonably justifiable in a democratic society."
    },
    {
      "paragraph": 4,
      "text": "(3) Nothing contained in or done under the authority of any law shall be held to be inconsistent with or in contravention of sub-article (1), to the extent that the law in question makes provision that is reasonably required in the interests of public safety, public order, public morality or decency, public health, or the protection of the rights and freedoms of others, and except so far as that provision or, as the case may be, the thing done under the authority thereof, is shown not to be reasonably justifiable in a democratic society."
    }
  ],
  "amendmentHistory": null,
  "crossReferences": [],
  "notes": "This article guarantees freedom of conscience and religious worship and establishes protections against forced religious instruction, with certain exceptions."
} 