{
  "number": 100,
  "title": "Magistrates",
  "chapterNumber": 8,
  "chapterTitle": "The Judiciary",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Magistrates of the inferior courts shall be appointed by the President acting in accordance with the recommendation made by the Judicial Appointments Committee established by article 96A of the Constitution."
    },
    {
      "paragraph": 2,
      "text": "(2) A person shall not be qualified to be appointed to or to act in the office of magistrate of the inferior courts unless he has practised as an advocate in Malta for a period of, or periods amounting in the aggregate to, not less than seven years."
    },
    {
      "paragraph": 3,
      "text": "(3) Without prejudice to sub-article (4), a magistrate of the inferior courts shall vacate his office upon reaching the age of sixty-five (65) years: Provided that a magistrate of the inferior courts shall inform the Chief Justice and the President of Malta of this decision before he reaches the age of sixty-five (65) years once he chooses to remain in office until he reaches the age of sixty-eight (68) years."
    },
    {
      "paragraph": 4,
      "text": "(4) The provisions of sub-article (2) of article 97 of the Constitution shall apply to a magistrate of the inferior courts."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Amended by Acts LVIII of 1974, XIV of 2007, XLIV of 2016, XLIII of 2020, XLV of 2020, and LV of 2020",
    "legalReference": "LVIII.1974.50; XIV.2007.5; XLIV.2016.6; XLIII.2020.5; XLV.2020.6; LV.2020.3"
  },
  "crossReferences": [
    {
      "article": "96A",
      "articleNumber": "96A",
      "chapterNumber": "8",
      "description": "Judicial Appointments Committee"
    },
    {
      "article": 97,
      "articleNumber": "97",
      "chapterNumber": "8",
      "description": "Tenure of office of judges"
    }
  ],
  "notes": "This article outlines the appointment, qualifications, and tenure of magistrates of the inferior courts."
} 