{
  "number": 95,
  "title": "Superior Courts",
  "chapterNumber": 8,
  "chapterTitle": "The Judiciary",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be in and for Malta such Superior Courts having such powers and jurisdiction as may be provided by any law for the time being in force in Malta."
    },
    {
      "paragraph": 2,
      "text": "(2) One of the Superior Courts, composed of such three judges as could, in accordance with any law for the time being in force in Malta, compose the Court of Appeal, shall be known as the Constitutional Court and shall have jurisdiction to hear and determine -"
    },
    {
      "paragraph": 3,
      "text": "(a) such questions as are referred to in article 63 of the Constitution;"
    },
    {
      "paragraph": 4,
      "text": "(b) any reference made to it in accordance with article 56 of this Constitution and any matter referred to it in accordance with any law relating to the election of members of the House of Representatives;"
    },
    {
      "paragraph": 5,
      "text": "(c) appeals from decisions of the Civil Court, First Hall, under article 46 of this Constitution;"
    },
    {
      "paragraph": 6,
      "text": "(d) appeals from decisions of any court of original jurisdiction in Malta as to the interpretation of this Constitution other than those which may fall under article 46 of this Constitution;"
    },
    {
      "paragraph": 7,
      "text": "(e) appeals from decisions of any court of original jurisdiction in Malta on questions as to the validity of laws other than those which may fall under article 46 of this Constitution; and"
    },
    {
      "paragraph": 8,
      "text": "(f) any question decided by a court of original jurisdiction in Malta together with any of the questions referred to in the foregoing paragraphs of this sub-article on which an appeal has been made to the Constitutional Court: Provided that nothing in this paragraph shall preclude an appeal being brought separately before the Court of Appeal in accordance with any law for the time being in force in Malta."
    },
    {
      "paragraph": 9,
      "text": "(3) Notwithstanding the provisions of sub-article (2) of this article, if any such question as is referred to in paragraph (d) or (e) of that sub-article arises for the first time in proceedings in a court of appellate jurisdiction, that court shall refer the question to the court which gave the original decision, unless in its opinion the raising of the question is merely frivolous or vexatious, and that court shall give its decision on any such question and, subject to any appeal in accordance with the provisions of sub-article (2) of this article, the court in which the question arose shall dispose of the question in accordance with that decision."
    },
    {
      "paragraph": 10,
      "text": "(4) The provisions of sub-articles (6) and (7) of article 46 of this Constitution shall apply to the Constitutional Court and for that purpose references to that article in the said sub-articles shall be construed as references to this article."
    },
    {
      "paragraph": 11,
      "text": "(5) If at any time during an election of members of the House of Representatives and the period of thirty days following any such election, the Constitutional Court is not constituted as provided in this article, the said Court shall, thereupon and until otherwise constituted according to law, be constituted by virtue of this sub-article and shall be composed of the three more senior of the judges then in office, including, if any is in office, the Chief Justice or other judge performing the functions of Chief Justice; and if at any other time the said Court is not constituted as provided in this article for a period exceeding fifteen days, such Court shall, upon the expiration of the said period of fifteen days and until otherwise constituted according to law, be constituted by virtue of this sub-article and shall be composed of the three more senior judges as aforesaid."
    },
    {
      "paragraph": 12,
      "text": "(6) The judges of the Superior Courts shall be a Chief Justice and such number of other judges as may be prescribed by any law for the time being in force in Malta: Provided that the office of a judge of the Superior Courts shall not, without his consent, be abolished during his continuance in office."
    }
  ],
  "amendmentHistory": {
    "date": "1974",
    "description": "Substituted by Act LVIII of 1974",
    "legalReference": "LVIII.1974.46"
  },
  "crossReferences": [
    {
      "article": 46,
      "articleNumber": "46",
      "chapterNumber": "4",
      "description": "Enforcement of protective provisions"
    },
    {
      "article": 56,
      "articleNumber": "56",
      "chapterNumber": "6",
      "description": "Determination of questions as to membership"
    },
    {
      "article": 63,
      "articleNumber": "63",
      "chapterNumber": "6",
      "description": "Determination of questions as to validity of laws"
    }
  ],
  "notes": "This article establishes the Superior Courts of Malta, with special focus on the Constitutional Court, its composition, and jurisdiction."
} 