{
  "number": "101C",
  "title": "Removal from office of judges and magistrates for gross negligence",
  "chapterNumber": 8,
  "chapterTitle": "The Judiciary",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) Where a judge or magistrate fails to deliver not less than five judgments, decrees or orders within the period of one year from when they were due to be delivered, the Chief Justice shall, within fifteen days from the end of the year during which the judgments, decrees or orders should have been given, without the necessity of any complaint, refer the matter to the Commission for the Administration of Justice and upon being examined the Commission may, after considering the matter, advise the President to remove the judge or magistrate, as the case may be, from office, and the President shall act in accordance with the advice of the Commission."
    },
    {
      "paragraph": 2,
      "text": "(2) Prior to advising the President in accordance with sub-article (1), the judge or magistrate, as the case may be, shall be given the opportunity to present his defence before the Commission for the Administration of Justice and the judge or magistrate may be assisted by an advocate or by a legal procurator, and the President shall remove the judge or magistrate from office only on a resolution supported by not less than two-thirds of all the members of the Commission, or on a resolution of the House of Representatives on the grounds of proved inability to perform the functions of office (whether arising from infirmity of body or mind or any other cause) or proved misbehaviour."
    },
    {
      "paragraph": 3,
      "text": "(3) The Commission for the Administration of Justice may, in circumstances which it considers to be special, exempt the Chief Justice from making a reference in terms of sub-article (1), and this either with reference to all judges and magistrates or with reference to such judge or magistrate as it may expressly indicate."
    },
    {
      "paragraph": 4,
      "text": "(4) For the purposes of this article, a judgment, decree or order is deemed to be due for delivery within a maximum period of six months from the conclusion of the pleadings as provided by law or in terms of a practice direction issued by the Chief Justice, or from when a judgment is reserved or a matter is otherwise adjourned for judgment."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Added by Act XLIV of 2016, amended by Act XLV of 2020",
    "legalReference": "XLIV.2016.8; XLV.2020.8"
  },
  "crossReferences": [
    {
      "article": "101A",
      "articleNumber": "101A",
      "chapterNumber": "8",
      "description": "Commission for the Administration of Justice"
    }
  ],
  "notes": "This article establishes a specific procedure for the removal of judges and magistrates based on gross negligence, particularly when they fail to deliver at least five judgments, decrees, or orders within a year. It outlines the role of the Chief Justice in referring such matters to the Commission for the Administration of Justice and the process for determining removal from office."
} 