{
  "number": 98,
  "title": "Acting Chief Justice and acting judges",
  "chapterNumber": 8,
  "chapterTitle": "The Judiciary",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) If the office of Chief Justice is vacant or if the Chief Justice is for any reason unable to perform the functions of his office, then, until a person has been appointed to and has assumed the functions of that office or until the Chief Justice has resumed those functions, as the case may be, those functions shall (except to such extent, if any, as other provision is made by law) be performed by such one of the other judges of the Superior Courts as may be designated in that behalf by the President, acting in accordance with the advice of the Prime Minister."
    },
    {
      "paragraph": 2,
      "text": "(2) If the office of any judge of the Superior Courts (other than the Chief Justice) is vacant or if any such judge is appointed to act as Chief Justice or is for any reason unable to perform the functions of his office, the President, acting in accordance with the advice of the Prime Minister, may appoint a person qualified for appointment as a judge of the Superior Courts to act as a judge of those Courts: Provided that a person may be so appointed notwithstanding that he has attained the age of sixty-five years."
    },
    {
      "paragraph": 3,
      "text": "(3) Any person appointed under sub-article (2) of this article to act as a judge of the Superior Courts shall continue so to act for the period of his appointment or, if no such period is specified, until his appointment is revoked by the President acting in accordance with the advice of the Prime Minister."
    }
  ],
  "amendmentHistory": {
    "date": "1974",
    "description": "Amended by Act LVIII of 1974",
    "legalReference": "LVIII.1974.49"
  },
  "crossReferences": [],
  "notes": "This article establishes procedures for appointing an Acting Chief Justice when the office is vacant or the Chief Justice is unable to perform their functions, and for appointing acting judges of the Superior Courts."
} 