{
  "number": "101A",
  "title": "Commission for the Administration of Justice",
  "chapterNumber": 8,
  "chapterTitle": "The Judiciary",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be a Commission for the Administration of Justice which shall consist of the President, who shall be the Chairman, and nine other members as follows:"
    },
    {
      "paragraph": 2,
      "text": "(a) the Chief Justice who shall be Deputy Chairman and shall preside over the Commission in the absence of the Chairman;"
    },
    {
      "paragraph": 3,
      "text": "(b) two members elected for a period of four years by the judges of the Superior Court from among themselves;"
    },
    {
      "paragraph": 4,
      "text": "(c) two members elected for a period of four years by the magistrates of the Inferior Courts from among themselves;"
    },
    {
      "paragraph": 5,
      "text": "(d) two members appointed for a period of four years as to one by the Prime Minister and as to the other by the Leader of the Opposition, being in each case, a person of at least forty-five years of age, and who enjoys the general respect of the public and a reputation of integrity and honesty;"
    },
    {
      "paragraph": 6,
      "text": "(e) the President of the Chamber of Advocates, ex officio."
    },
    {
      "paragraph": 7,
      "text": "(2) The President shall have an original vote."
    },
    {
      "paragraph": 8,
      "text": "(3) The members elected to the Commission for the Administration of Justice shall be elected in accordance with such rules as may be prescribed by the person or authority referred to in sub-article (7) of article 46 of this Constitution."
    },
    {
      "paragraph": 9,
      "text": "(4) (a) A person shall not be qualified to be appointed or continue to hold office as a member of the Commission for the Administration of Justice: (i) if he is a Minister, a Parliamentary Secretary, a Member of the House of Representatives or a member of a local government authority; or (ii) if he has been convicted of any crime punishable by imprisonment for any term; or (iii) if he is disqualified to be elected as a member of the House of Representatives for any of the reasons stated in paragraphs (a), (c), (d), (e), (f), (g) or (h) of sub-article (1) of article 54 of this Constitution."
    },
    {
      "paragraph": 10,
      "text": "(b) The office of a member of the Commission for the Administration of Justice shall become vacant if any circumstances arise that if he were not a member of the Commission he would not qualify for membership thereof, and a member of the Commission may abstain or be challenged in the same circumstances as a judge of the superior courts."
    },
    {
      "paragraph": 11,
      "text": "(5) (a) Where a person fills a vacancy caused by a member of the Commission for the Administration of Justice ceasing to be such a member for any reason, other than the expiration of the period of office, such person shall hold office for the unexpired period of office of the member he replaces."
    },
    {
      "paragraph": 12,
      "text": "(b) Where a member of the Commission has been challenged or has abstained, the President acting in accordance with his own deliberate judgement shall appoint as a substitute member to sit on the Commission, a person who in his opinion has as far as may be the same qualities and qualifications as the member substituted."
    },
    {
      "paragraph": 13,
      "text": "(c) Where the members who, are to be elected under paragraph (c) and (d) of sub-article (1) of this article, or who are to be appointed under paragraph (e) of the same sub-article, are not so elected or appointed within two weeks from a call for the purpose by the President, the President who in making such appointment shall act in accordance with his own deliberate judgement shall himself appoint members in their stead who where possible in his opinion shall have the same qualities and qualifications as such members."
    },
    {
      "paragraph": 14,
      "text": "(6) (a) The Commission for the Administration of Justice shall at all times have a committee for Advocates and Legal Procurators which shall have such composition, functions, powers and duties as may be assigned to it by law. The Commission shall in the exercise of any of its functions in relation to the professions of Advocates and Legal Procurators act through the said committees in such manner and subject to such review as may by the said law be provided."
    },
    {
      "paragraph": 15,
      "text": "(b) Notwithstanding the provisions of paragraph (a) of this sub-article, the Commission shall refer to the Committee for Advocates and Legal Procurators (hereinafter in this article referred to as \"the Committee\") any matter concerning the misconduct of an advocate or legal procurator in the exercise of their profession, and, saving in the case of an appeal, the Commission shall not act otherwise than on receipt of, and in accordance with, the findings of the Committee in any such matter. So however that, where a report of findings by the Committee has not been submitted to the Commission within two months from the day on which the matter was brought before the Committee, or within such further period or periods as the Commission may allow, which shall in no case, except for very exceptional reasons, exceed a further four months, the Commission shall thereupon itself investigate and determine the matter."
    },
    {
      "paragraph": 16,
      "text": "(c) Without prejudice to the provisions of the foregoing paragraph the Commission may appoint such other committees to assist it on any matter falling within its functions as it may deem fit."
    },
    {
      "paragraph": 17,
      "text": "(7) In the exercise of their functions the members of the Commission and of any of its committees shall act on their individual judgement and shall not be subject to the direction or control of any person or authority."
    },
    {
      "paragraph": 18,
      "text": "(8) Sub-articles (2) and (3) of article 121 of this Constitution shall apply to any committee of the Commission."
    },
    {
      "paragraph": 19,
      "text": "(9) There shall be a secretary of the Commission for the Administration of Justice who shall also act as secretary of any committee of the Commission. The Secretary of the Commission shall be appointed by the Commission from among public officers assigned to the Courts or from among members of the legal professions. The Secretary shall hold office until such time as his appointment is terminated by the Commission."
    },
    {
      "paragraph": 20,
      "text": "(10) A person appointed as a member of the Commission for the Administration of Justice or any of its committees may be removed from office by the President, acting in accordance with the advice of the body or the holder of the office appointing such member, but he may be removed only for inability to discharge the functions of his office (whether arising from infirmity of mind or body or any other cause) or for misbehaviour."
    },
    {
      "paragraph": 21,
      "text": "(11) The functions of the Commission for the Administration of Justice shall be:"
    },
    {
      "paragraph": 22,
      "text": "(a) to supervise the workings of all the superior and inferior courts and to make such recommendations to the Minister responsible for justice as to the remedies, which appear to it, conductive to a more efficient functioning of such courts;"
    },
    {
      "paragraph": 23,
      "text": "(b) to advise the Minister responsible for justice on any matter relating to the organisation of the administration of justice;"
    },
    {
      "paragraph": 24,
      "text": "(c) to exercise, subject to article 101B of this Constitution, discipline on judges and magistrates;"
    },
    {
      "paragraph": 25,
      "text": "(d) to draw up a code or codes of ethics regulating the conduct of members of the judiciary;"
    },
    {
      "paragraph": 26,
      "text": "(e) on the advice of the Committee for Advocates and Legal Procurators to draw up a code or codes of ethics regulating the professional conduct of members of those professions: Provided that where such advice is not given within such time as the Commission may establish, the Commission may draw up such code or codes without the necessity of such advice;"
    },
    {
      "paragraph": 27,
      "text": "(f) to draw the attention of any judge or magistrate on any matter, in any court in which he sits, which may not be conducive to an efficient and proper functioning of such court;"
    },
    {
      "paragraph": 28,
      "text": "(g) to exercise, in accordance with any law, discipline over advocates and legal procurators practising their profession; and"
    },
    {
      "paragraph": 29,
      "text": "(h) such other function as may be assigned to it by law."
    },
    {
      "paragraph": 30,
      "text": "(12) The Commission for the Administration of Justice shall each year make a report to the Minister responsible for justice on its activities during the previous calendar year, and shall at any time, when it deems fit or as may be required by the said Minister, make a report on any particular matter to the said Minister."
    },
    {
      "paragraph": 31,
      "text": "(13) The powers of the President under any law with regard to the subrogation of judges and magistrates and to the assignment of duties of judges and magistrates shall be exercised on the recommendation of the Chief Justice: Provided that where the Chief Justice fails to make a recommendation to the President, the President shall exercise this power on the advice of the Minister responsible for justice: Provided further that in any such case the Minister responsible for justice shall immediately publish in the Gazette, a notice of that fact together with the reasons therefore, and he shall make a statement of such fact in the House not later than the second sitting immediately after he has so advised the President."
    },
    {
      "paragraph": 32,
      "text": "(14) Subject to provisions of sub-article (1) of article 101C of the Constitution, the question whether the Commission for the Administration of Justice has validly performed any function vested in it by or under this Constitution shall not be enquired into in any court."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Added by Act IX of 1994, amended by Acts XLIV of 2016 and XLV of 2020",
    "legalReference": "IX.1994.2; XLIV.2016.7; XLV.2020.7"
  },
  "crossReferences": [
    {
      "article": 46,
      "articleNumber": "46",
      "chapterNumber": "4",
      "description": "Enforcement of protective provisions"
    },
    {
      "article": 54,
      "articleNumber": "54",
      "chapterNumber": "6",
      "description": "Disqualifications for membership of House of Representatives"
    },
    {
      "article": "101B",
      "articleNumber": "101B",
      "chapterNumber": "8",
      "description": "Discipline of judges and magistrates"
    },
    {
      "article": "101C",
      "articleNumber": "101C",
      "chapterNumber": "8",
      "description": "Appeal from the decisions of the Commission for the Administration of Justice"
    },
    {
      "article": 121,
      "articleNumber": "121",
      "chapterNumber": "11",
      "description": "Prerogative of mercy"
    }
  ],
  "notes": "This article establishes the Commission for the Administration of Justice, detailing its composition, functions, and procedures for supervising the judiciary and legal professions."
} 