{
  "number": 96,
  "title": "Appointment of judges",
  "chapterNumber": 8,
  "chapterTitle": "The Judiciary",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) The judges of the superior courts shall be appointed by the President acting in accordance with the recommendation made by the Judicial Appointments Committee established by article 96A of the Constitution."
    },
    {
      "paragraph": 2,
      "text": "(2) A person shall not be qualified to be appointed a judge of the Superior Courts unless for a period of, or periods amounting in the aggregate to, not less than twelve years he has either practised as an advocate in Malta or served as a magistrate in Malta, or has partly so practised and partly so served."
    },
    {
      "paragraph": 3,
      "text": "(3) The Chief Justice shall be appointed by the President acting in accordance with a resolution of the House supported by the votes of not less than two-thirds of all the members of the House: Provided that notwithstanding the provisions of article 97(1), if the Resolution is not supported by the votes of not less than two-thirds of all the members of the House, the person occupying the office of Chief Justice shall, in any circumstance, remain in office until the Resolution is supported by the votes of not less than two-thirds of all the members of the House."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Amended by Acts LVIII of 1974, XLIV of 2016, and XLIII of 2020",
    "legalReference": "LVIII.1974.47; XLIV.2016.3; XLIII.2020.2"
  },
  "crossReferences": [
    {
      "article": "96A",
      "articleNumber": "96A",
      "chapterNumber": "8",
      "description": "Judicial Appointments Committee"
    },
    {
      "article": 97,
      "articleNumber": "97",
      "chapterNumber": "8",
      "description": "Tenure of office of judges"
    }
  ],
  "notes": "This article outlines the process for appointing judges to the Superior Courts, including the qualifications required and the special procedure for appointing the Chief Justice."
} 