{
  "number": "96A",
  "title": "Judicial Appointments Committee",
  "chapterNumber": 8,
  "chapterTitle": "The Judiciary",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be a Judicial Appointments Committee, hereinafter in this article referred to as \"the Committee\", which shall be a subcommittee of the Commission for the Administration of Justice established by article 101A of this Constitution and which shall be composed as follows:"
    },
    {
      "paragraph": 2,
      "text": "(a) the Chief Justice;"
    },
    {
      "paragraph": 3,
      "text": "(b) two (2) members elected for a period of four (4) years by the judges of the superior court from among themselves;"
    },
    {
      "paragraph": 4,
      "text": "(c) one member elected for a period of four (4) years by the magistrates of the inferior courts from among themselves;"
    },
    {
      "paragraph": 5,
      "text": "(d) the Auditor General;"
    },
    {
      "paragraph": 6,
      "text": "(e) the Commissioner for Administrative Investigations (Ombudsman); and"
    },
    {
      "paragraph": 7,
      "text": "(f) the President of the Chamber of Advocates: Provided that the President of the Chamber of Advocates shall not be eligible to be appointed a member of the judiciary before the expiration of a period of two (2) years starting from the day on which he last occupied a post on the Committee or he was last a Committee member."
    },
    {
      "paragraph": 8,
      "text": "(2) The Committee shall be chaired by the Chief Justice or, in his absence, by the judge who substitutes him in accordance with paragraph (d) of sub-article (3)."
    },
    {
      "paragraph": 9,
      "text": "(3) (a) A person shall not be qualified to be appointed or to continue to hold office as a member of the Committee if he is a Minister, a Parliamentary Secretary, a Member of the House of Representatives, a member of a local government or an official or a candidate of a political party: Provided that where the President of the Chamber of Advocates is not qualified to be appointed or to hold office as aforesaid the Chamber of Advocates shall nominate another advocate to sit on the Committee in his stead."
    },
    {
      "paragraph": 10,
      "text": "(b) The office of a member of the Committee shall become vacant if any circumstances arise that, if the person were not a member of the Committee, the person would not qualify for membership thereof."
    },
    {
      "paragraph": 11,
      "text": "(c) A member of the Committee may abstain or be challenged in the same circumstances as a judge of the Superior Courts."
    },
    {
      "paragraph": 12,
      "text": "(d) Where a member of the Committee abstains or is challenged, in the case of the Chief Justice he shall be substituted by a judge who shall be the next most senior judge in office, in the case of the Auditor General he shall be substituted by the next most senior officer according to office in the National Audit Office, in the case of the Commissioner for Administrative Investigations he shall be substituted by the next most senior officer according to the Office of the Ombudsman and in the case of the President of the Chamber of Advocates he shall be replaced by the next most senior advocate according to office in the committee of the Chamber of Advocates."
    },
    {
      "paragraph": 13,
      "text": "(4) In the exercise of their functions the members of the Committee shall act on their individual judgement and shall not be subject to the direction or control of any person or authority."
    },
    {
      "paragraph": 14,
      "text": "(5) There shall be a Secretary to the Committee who shall be appointed by the Minister responsible for justice."
    },
    {
      "paragraph": 15,
      "text": "(6) The functions of the Committee shall be:"
    },
    {
      "paragraph": 16,
      "text": "(a) to receive and examine expressions of interest from persons interested in being appointed to the office of judge of the Superior Courts (other than the office of Chief Justice) or of magistrate of the Inferior Courts, except from persons to whom paragraph (e) applies;"
    },
    {
      "paragraph": 17,
      "text": "(b) to keep a permanent register of expressions of interest mentioned in paragraph (a) and to the acts relative thereto, which register shall be kept secret and shall be accessible only to the members of the Committee, and the President of Malta;"
    },
    {
      "paragraph": 18,
      "text": "(c) to conduct interviews and evaluations of candidates for the above-mentioned offices in such manner as it deems appropriate and for this purpose to request information from any public authority as it considers to be reasonably required;"
    },
    {
      "paragraph": 19,
      "text": "(d) when a vacancy in the office of judge or magistrate occurs, the Committee shall send to the President, through the Secretary, the names of three candidates that the Committee considers to be most suitable along with a detailed report on the suitability and merit of these three candidates who, in the opinion of the Committee, are deemed to be the most suitable for the appointment of these offices: Provided that the President shall be entitled to elect a judge or a magistrate exclusively from the names of the three candidates transmitted by the Committee which names of the three candidates shall be made public in the President's decision;"
    },
    {
      "paragraph": 20,
      "text": "(e) to give advice on appointment to any other judicial office or office in the courts as the Minister responsible for justice may from time to time request;"
    },
    {
      "paragraph": 21,
      "text": "(f) to approach with a view of eliciting interest amongst qualified persons for the office of judge or magistrate: Provided that the evaluation referred to in paragraph (d) shall be made by not later than sixty days from when the Committee receives the expression of interest and the advice mentioned in paragraphs (e) and (f) shall be given by not later than thirty days from when it was requested, or within such other time limits as the Minister responsible for justice may, with the agreement of the Committee, by order in the Gazette establish."
    },
    {
      "paragraph": 22,
      "text": "(7) The proceedings of the Committee shall be confidential and shall be held in camera and no member or secretary of the Committee may be called to give evidence before any court or other body with regard to any document received by or any matter discussed or communicated to or by the Committee."
    },
    {
      "paragraph": 23,
      "text": "(8) The Committee shall regulate its own procedure and shall be obliged to publish without being subject to any direction the policy amongst others of maintaining gender balance in the appointment of members of the judiciary, which shall guide the Committee."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Added by Act XLIV of 2016, amended by Act XLIII of 2020",
    "legalReference": "XLIV.2016.5; XLIII.2020.3"
  },
  "crossReferences": [
    {
      "article": "101A",
      "articleNumber": "101A",
      "chapterNumber": "8",
      "description": "Commission for the Administration of Justice"
    }
  ],
  "notes": "This article establishes the Judicial Appointments Committee as a subcommittee of the Commission for the Administration of Justice, detailing its composition, functions, and procedures for recommending judicial appointments."
} 