{
  "number": "101B",
  "title": "Discipline of judges and magistrates",
  "chapterNumber": 8,
  "chapterTitle": "The Judiciary",
  "content": [
    {
      "paragraph": 1,
      "text": "(1) There shall be a Committee for Judges and Magistrates (hereinafter referred to as \"the Committee\") which shall be a subcommittee of the Commission for the Administration of Justice established by article 101A of this Constitution and which shall consist of three members of the judiciary who are not members of the Commission for the Administration of Justice and who shall be elected from amongst judges and magistrates according to regulations issued by the Commission for the Administration of Justice so however that in disciplinary proceedings against a magistrate two of the three members shall be magistrates and in the case of disciplinary proceedings against a judge two of the three members shall be judges."
    },
    {
      "paragraph": 2,
      "text": "(2) The Chairman of the Committee shall be elected by the members of the Committee from amongst themselves."
    },
    {
      "paragraph": 3,
      "text": "(3) Any member of the Committee may be challenged and shall abstain in the same circumstances as a judge of the Superior Courts may be challenged or may abstain. Where a member has been challenged or has abstained, the Commission for the Administration of Justice shall appoint a substitute member."
    },
    {
      "paragraph": 4,
      "text": "(4) The Committee shall exercise discipline on judges and magistrates in the manner prescribed in this article."
    },
    {
      "paragraph": 5,
      "text": "(5) Disciplinary proceedings against a judge or a magistrate shall be commenced upon a complaint in writing and containing definite charges made to the Committee by the Chief Justice or by the Minister responsible for justice, for breach of the provisions of the Code of Ethics for Members of the Judiciary or of a code or disciplinary rules for members of the judiciary promulgated according to the same procedure according to which the said Code of Ethics is promulgated which are from time to time applicable to the members of the judiciary. The complaint shall also include the grounds upon which each of such charges is based."
    },
    {
      "paragraph": 6,
      "text": "(6) The Committee shall, upon receipt of a complaint under sub-article (5), notify the said complaint to the judge or magistrate against whom it is made granting him or her a reasonable time to reply."
    },
    {
      "paragraph": 7,
      "text": "(7) If, following prima facie consideration of the complaint and of the reply, the Committee considers that there are not sufficient grounds to commence disciplinary proceedings, the Committee shall refrain from further consideration of the case."
    },
    {
      "paragraph": 8,
      "text": "(8) If, following the consideration of the complaint and of the reply as referred to in sub-article (7), the Committee considers that there are sufficient grounds to continue the disciplinary proceedings the Committee shall appoint a date for the hearing."
    },
    {
      "paragraph": 9,
      "text": "(9) Proceedings before the Committee shall be held in camera unless the judge or magistrate against whom the proceedings are taken requests otherwise. The complainant or his representative and the judge or magistrate against whom the proceedings are taken shall have a right to be present during the whole of the proceedings, to produce witnesses in support or in defence of the charges set in the complaint, and to be assisted by an advocate or a legal procurator. The Commission for the Administration of Justice may also appoint an advocate to act as a special independent prosecutor in the disciplinary proceedings."
    },
    {
      "paragraph": 10,
      "text": "(10) If the Committee finds that the judge or magistrate has breached the Code of Ethics for Members of the Judiciary it shall:"
    },
    {
      "paragraph": 11,
      "text": "(a) if it considers that the breach is of a minor nature, either issue a warning or impose a pecuniary penalty recoverable as a civil debt payable to the Secretary of the Commission for the Administration of Justice, not exceeding ten per centum of the annual salary of the judge or magistrate as at the time established according to law;"
    },
    {
      "paragraph": 12,
      "text": "(b) if it considers that the breach is of a serious nature it may suspend the judge or magistrate from the exercise of his duties for a period of not more than six months on half of his salary and allowances as recoverable at the time;"
    },
    {
      "paragraph": 13,
      "text": "(c) if it considers that the breach is of such a serious nature as to merit the removal of the judge or magistrate from office, or is based on the grounds of incapacity to perform the functions of his office (both whether for bodily or mental illness or for any other reason), it shall report its findings to the Commission for the Administration of Justice which shall consider whether the evidence proves the case prima facie and, if it considers that there is such degree of proof, the Commission shall suspend the judge or magistrate concerned and shall proceed with the hearing of the case. During the period during which a judge or magistrate is suspended in accordance with the provisions of this paragraph, which shall not exceed six (6) months, the judge or magistrate shall be entitled to half the salary and allowances relative to the office and after the expiry of such a period of six (6) months he shall resume receiving his salary and all allowances for his post irrespective of whether or not the case referred has been concluded. In the event that the Commission for the Administration of Justice considers that the breach under investigation merits the removal of the judge or magistrate from office, it shall proceed to advise the President to remove the judge or magistrate from office for proven misconduct or proven incapacity to perform the functions of his office: Provided that in the event that the proceedings before the Commission for the Administration of Justice do not result in the removal of the member of the judiciary, then the member of the judiciary shall be paid the salary and allowances which have been held throughout the period of suspension."
    },
    {
      "paragraph": 14,
      "text": "(11) The Committee may also upon the request of the Chief Justice order that a judge or a magistrate be suspended from the performance of his duties on serious medical grounds for a definite period during which the said judge or magistrate shall continue to receive his full salary and allowances. The procedure laid down in this article in respect of disciplinary proceedings shall apply mutatis mutandis in the case of any proceedings taken under this sub-article."
    },
    {
      "paragraph": 15,
      "text": "(12) (a) There shall be a right of appeal to the Commission for the Administration of Justice from decisions of the Committee by the judge or magistrate against whom the Committee makes a finding."
    },
    {
      "paragraph": 16,
      "text": "(b) The appeal shall be filed with the Secretary of the Commission for the Administration of Justice by not later than twenty days from when the Committee delivers its decision."
    },
    {
      "paragraph": 17,
      "text": "(c) The filing of an appeal as aforesaid shall suspend the execution of the decision of the Committee."
    },
    {
      "paragraph": 18,
      "text": "(d) The Commission for the Administration of Justice may from time to time establish rules of procedure for such appeals."
    },
    {
      "paragraph": 19,
      "text": "(e) The President of Malta shall not form part of the Commission for the Administration of Justice when the said Commission is hearing an appeal from a decision of the Committee."
    },
    {
      "paragraph": 20,
      "text": "(13) Proceedings before the Committee shall be concluded within a period of one year and appeal proceedings before the Commission for the Administration of Justice shall be concluded within a further period of six months."
    },
    {
      "paragraph": 21,
      "text": "(14) In the exercise of their function under this article the Commission for the Administration of Justice and the Committee for Judges and Magistrates shall have all the powers as are assigned to the First Hall of the Civil Court by the Code of Organization and Civil Procedure or by any law from time to time regulating the powers of Courts of civil jurisdiction."
    },
    {
      "paragraph": 22,
      "text": "(15) In the exercise of their functions the members of the Committee shall act on their own individual judgment and shall not be subject to the direction or control of any other person or authority."
    },
    {
      "paragraph": 23,
      "text": "(16) The provisions of this article shall be without prejudice to the application of sub-articles (2) and (3) of article 97 of this Constitution wherever they may apply."
    }
  ],
  "amendmentHistory": {
    "date": "2020",
    "description": "Added by Act XLIV of 2016, amended by Act XLV of 2020",
    "legalReference": "XLIV.2016.8; XLV.2020.8"
  },
  "crossReferences": [
    {
      "article": "101A",
      "articleNumber": "101A",
      "chapterNumber": "8",
      "description": "Commission for the Administration of Justice"
    },
    {
      "article": 97,
      "articleNumber": "97",
      "chapterNumber": "8",
      "description": "Tenure of office of judges"
    }
  ],
  "notes": "This article establishes the Committee for Judges and Magistrates as a subcommittee of the Commission for the Administration of Justice and details the disciplinary procedures for judges and magistrates, including the process for complaints, hearings, and potential sanctions."
} 